[
  {
    "job_id": "4204054198",
    "title": "Data Engineer (Pyspark)",
    "company": "Virtusa",
    "location": "Bangalore Urban, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/data-engineer-pyspark-at-virtusa-4204054198?position=1&pageNum=0&refId=wQ76I2ig11brstfWA%2BFLpQ%3D%3D&trackingId=9S%2Bx0MQHB9IP0ZgVDencog%3D%3D",
    "description": "About The Role\n\nWe are seeking a highly skilled Data Engineer with deep expertise in PySpark and the Cloudera Data Platform (CDP) to join our data engineering team. As a Data Engineer, you will be responsible for designing, developing, and maintaining scalable data pipelines that ensure high data quality and availability across the organization. This role requires a strong background in big data ecosystems, cloud-native tools, and advanced data processing techniques.\n\nThe ideal candidate has hands-on experience with data ingestion, transformation, and optimization on the Cloudera Data Platform, along with a proven track record of implementing data engineering best practices. You will work closely with other data engineers to build solutions that drive impactful business insights.\n\nResponsibilities\n\nData Pipeline Development: Design, develop, and maintain highly scalable and optimized ETL pipelines using PySpark on the Cloudera Data Platform, ensuring data integrity and accuracy.\n\nData Ingestion: Implement and manage data ingestion processes from a variety of sources (e.g., relational databases, APIs, file systems) to the data lake or data warehouse on CDP.\n\nData Transformation and Processing: Use PySpark to process, cleanse, and transform large datasets into meaningful formats that support analytical needs and business requirements.\n\nPerformance Optimization: Conduct performance tuning of PySpark code and Cloudera components, optimizing resource utilization and reducing runtime of ETL processes.\n\nData Quality and Validation: Implement data quality checks, monitoring, and validation routines to ensure data accuracy and reliability throughout the pipeline.\n\nAutomation and Orchestration: Automate data workflows using tools like Apache Oozie, Airflow, or similar orchestration tools within the Cloudera ecosystem.\n\nEducation and Experience\n\nBachelors or Masters degree in Computer Science, Data Engineering, Information Systems, or a related field.\n\n3+ years of experience as a Data Engineer, with a strong focus on PySpark and the Cloudera Data Platform.\n\nTechnical Skills\n\nPySpark: Advanced proficiency in PySpark, including working with RDDs, DataFrames, and optimization techniques.\n\nCloudera Data Platform: Strong experience with Cloudera Data Platform (CDP) components, including Cloudera Manager, Hive, Impala, HDFS, and HBase.\n\nData Warehousing: Knowledge of data warehousing concepts, ETL best practices, and experience with SQL-based tools (e.g., Hive, Impala).\n\nBig Data Technologies: Familiarity with Hadoop, Kafka, and other distributed computing tools.\n\nOrchestration and Scheduling: Experience with Apache Oozie, Airflow, or similar orchestration frameworks.\n\nScripting and Automation: Strong scripting skills in Linux.\nShow more "
  },
  {
    "job_id": "4261223485",
    "title": "Bigdata Developer - Proximus",
    "company": "Infosys",
    "location": "Bengaluru East, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/bigdata-developer-proximus-at-infosys-4261223485?position=3&pageNum=0&refId=wQ76I2ig11brstfWA%2BFLpQ%3D%3D&trackingId=E3laQ6Oo2GLUxFipYITJiw%3D%3D",
    "description": "You have experience with most of these technologies: HDFS, Ozone, Hive, Impala, Spark, Atlas, Ranger. Knowledge of GraphQL, Venafi (Certificate Mgt) and Collibra (Data Governance) is an asset.\n\n\nExperience in a telecommunication environment and real-time technologies with focus on high availability and high-volume processing is an advantage: o Kafka o Flink o Spark Streaming\nYou master programming languages as Java & Python/PySpark as well as SQL and are proficient in UNIX scripting\nData formats like JSON, Parquet, XML and REST API have no secrets for you\nYou have experience with CI/CD (GitLab/GitHub, Jenkins, Ansible, Nexus) for automated build & test. Knowledge of the Azure DevOps toolset is an asset. As project is preparing a “move to Azure”, the above will change slightly in the course of 2025. However, most of our current technological landscape remains a solid foundation for a role as EDH Data Engineer Build robust, performing and high scalable, flexible data pipelines with a focus on time to market with quality. Responsibilities:\nAct as an active team member to ensure high code quality (unit testing, regression tests) delivered in time and within budget.\nDocument the delivered code/solution\nParticipate to the implementation of the releases following the change & release management processes\nProvide support to the operation team in case of major incidents for which engineering knowledge is required.\nParticipate to effort estimations.\nProvide solutions (bug fixes) for problem mgt.\nGood knowledge on software configuration management systems\nStrong business acumen, strategy and cross-industry thought leadership\nAwareness of latest technologies and Industry trends\nLogical thinking and problem solving skills along with an ability to collaborate\nTwo or three industry domain knowledge\nUnderstanding of the financial processes for various types of projects and the various pricing models available\nClient Interfacing skills\nKnowledge of SDLC and agile methodologies\nProject and Team management\nShow more "
  },
  {
    "job_id": "4272740793",
    "title": "Associate Staff Engineer (Data Science)",
    "company": "Nagarro",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/associate-staff-engineer-data-science-at-nagarro-4272740793?position=4&pageNum=0&refId=wQ76I2ig11brstfWA%2BFLpQ%3D%3D&trackingId=8lcZ2dPrktNaVYTMSz%2BVGw%3D%3D",
    "description": "Company Description\n\n👋🏼We're Nagarro.\n\nWe are a Digital Product Engineering company that is scaling in a big way! We build products, services, and experiences that inspire, excite, and delight. We work at a scale — across all devices and digital mediums, and our people exist everywhere in the world (18000+ experts across 36 countries). Our work culture is dynamic and non-hierarchical. We're looking for great new colleagues. That's where you come in!\n\nJob Description\n\nREQUIREMENTS:\n\n\nMust have experience in Data Science Fundamentals, Data Analysis & Visualization, Statistics & Probability, SQL, Model Packaging & Deployment.\nMust have experience in prompt engineering, RAG & Generative AI.\nShould have experience in Python or R for Data Science.\nShould have experience in Classification-regression, Forecasting, Unsupervised Models, Recommendation Systems, Natural Language processing & Optimization.\nShould have experience in Data science on AWS/Azure/GCP.\nStrong troubleshooting skills in different disparate technologies and environments.\nShould be enthusiastic about different areas of work and exploring new technologies.\nShould have clarity of thought and strong communication skills to effectively pitch solutions.\nMust have ability to explore and grasp new technologies.\nMust be capable of mentoring team members in projects and helping them keep up with new technologies.\nShould be empowering the team members to be solution providers and enable a flat environment where everyone’s point of view is considered, and feedback is encouraged.\n\n\nRESPONSIBILITIES:\n\n\nWriting and reviewing great quality code\nUnderstanding the client’s business use cases and technical requirements and be able to convert them into technical design which elegantly meets the requirements.\nMapping decisions with requirements and be able to translate the same to developers.\nIdentifying different solutions and being able to narrow down the best option that meets the client’s requirements.\nDefining guidelines and benchmarks for NFR considerations during project implementation\nWriting and reviewing design document explaining overall architecture, framework, and high-level design of the application for the developers\nReviewing architecture and design on various aspects like extensibility, scalability, security, design patterns, user experience, NFRs, etc., and ensure that all relevant best practices are followed.\nDeveloping and designing the overall solution for defined functional and non-functional requirements; and defining technologies, patterns, and frameworks to materialize it.\nUnderstanding and relating technology integration scenarios and applying these learnings in projects\nResolving issues that are raised during code/review, through exhaustive systematic analysis of the root cause, and being able to justify the decision taken.\nCarrying out POCs to make sure that suggested design/technologies meet the requirements.\nShould be open to travel onsite once a month.\n\n\nQualifications\n\nBachelor’s or master’s degree in computer science, Information Technology, or a related field.\nShow more "
  },
  {
    "job_id": "4196665846",
    "title": "Business Intelligence Analyst / Data Engineer",
    "company": "Valtech",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/business-intelligence-analyst-data-engineer-at-valtech-4196665846?position=7&pageNum=0&refId=wQ76I2ig11brstfWA%2BFLpQ%3D%3D&trackingId=t7fMzgoyFOk8iTqvreuNUw%3D%3D",
    "description": "At Valtech, We’ve Got Opportunities To Offer You — For Growth, For Leadership, For Big, World-changing Impact And For, Dare We Say It, Fun. We Are a Global Workforce That Is Committed To Building a World That Works Better For Everyone. And That Starts With Our Kin. That’s Why We’re Proud Of\n\nThe role\n\nIdeal candidates will have strong quantitative backgrounds and analytical discipline. While they will have some demonstrated ability to write code, they will not have learned programming languages for the sake of building their resume, but rather as a means to express their intellectual curiosity and analytical voice. Valtech will provide a platform and training to help them reach their full potential.\n\nValtech is looking to hire a Business Intelligence Analyst / Data Engineer to join our growing capabilities team. If you are innovative, passionate about data and AI technologies, and look to continually learn and enjoy sharing expertise, read on!\n\nRole Responsibilities\n\n\nAnalyze a collection of raw data sets to create meaningful impact to large enterprise clients while maintaining a high degree of scientific rigor and discipline.\nEngineer data pipelines and products to help stakeholders make and execute data driven decisions.\nCommunicate analytical findings in an intuitive and visually compelling way.\nCreating highly visual and interactive dashboards via Tableau, PowerBI, or custom web applications\nConducting deep dive analysis and designing KPIs to help guide business decisions and measure success\nEngineering data infrastructure, software libraries, and APIs supporting BI and ML data pipelines\nArchitecting cloud data platform components enabling the above\nBuilding and tracking project timelines, dependences, and risks\nGathering stakeholder requirements and conducting technical due diligence toward designing pragmatic data-driven business solutions\n\n\nMinimum Qualifications\n\nWe want all new hires to succeed in their roles at Valtech. That's why we've outlined the job requirements below. To be considered for this role, it's important that you meet all Minimum Qualifications. If you do not meet all of the Preferred Qualifications, we still encourage you to apply.\n\n\nProven industry experience executing data engineering, analytics, and/or data science projects or Bachelors/Masters degree in quantitative studies including Engineering, Mathematics, Statistics, Computer Science or computation-intensive Sciences and Humanities.\nProficiency (can execute data ingestion to insight) in programmatic languages such as SQL, Python, and R.\n\n\nPreferred Qualifications\n\n\nProficiency in visualization/reporting tools such as Tableau and PowerBI or programmatic visualization library such as R ggplot2, Python matplotlib/seaborn/bokeh, Javascript D3.\nProficiency in big data environments and tools such as Spark, Hive, Impala, Pig, etc.\nProficiency with cloud architecture components (AWS, Azure, Google)\nProficiency with data pipeline software such as Airflow, Luigi, or Prefect\nAbility to turn raw data and ambiguous business questions into distilled findings and recommendations for action\nExperience with statistical and machine learning libraries along with the ability to apply them appropriately to business problems\nExperience leading and managing technical data/analytics/machine learning projects\n\n\nWhat We Offer\n\nYou’ll join an international network of data professionals within our organisation. We support continuous development through our dedicated Academy. If you're looking to push the boundaries of innovation and creativity in a culture that values freedom and responsibility, we encourage you to apply.\n\nAt Valtech, we’re here to engineer experiences that work and reach every single person. To do this, we are proactive about creating workplaces that work for every person at Valtech. Our goal is to create an equitable workplace which gives people from all backgrounds the support they need to thrive, grow and meet their goals (whatever they may be). You can find out more about what we’re doing to create a Valtech for everyone here.\n\nPlease do not worry if you do not meet all of the criteria or if you have some gaps in your CV. We’d love to hear from you and see if you’re our next member of the Valtech team!\nShow more "
  },
  {
    "job_id": "4234488284",
    "title": "Senior Engineer Consultant-Data Engineering",
    "company": "Verizon",
    "location": "Bengaluru East, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/senior-engineer-consultant-data-engineering-at-verizon-4234488284?position=8&pageNum=0&refId=wQ76I2ig11brstfWA%2BFLpQ%3D%3D&trackingId=Cest0Y3Ibqvy2w657nlKVA%3D%3D",
    "description": "When you join Verizon\n\nYou want more out of a career. A place to share your ideas freely — even if they’re daring or different. Where the true you can learn, grow, and thrive. At Verizon, we power and empower how people live, work and play by connecting them to what brings them joy. We do what we love — driving innovation, creativity, and impact in the world. Our V Team is a community of people who anticipate, lead, and believe that listening is where learning begins. In crisis and in celebration, we come together — lifting our communities and building trust in how we show up, everywhere & always. Want in? Join the #VTeamLife.\n\nWhat you’ll be doing...\n\nWe’re seeking a skilled Lead Senior Data Engineering Analyst to join our high-performing team and propel our telecom business forward. You’ll contribute to building cutting-edge data products and assets for our wireless and wireline operations, spanning areas like consumer analytics, network performance, and service assurance.\n\nIn this role, you will develop deep expertise in various telecom domains. As part of the Data Architecture & Strategy team, you’ll collaborate closely with IT and business stakeholders to design and implement user-friendly, robust data product solutions. This includes defining data quality and incorporating data classification and governance principles.\n\nYour responsibilities encompass\n\n\nCollaborating with stakeholders to understand data requirements and translate them into efficient data models\nDefining the scope and purpose of data product solutions, collaborating with stakeholders to finalize project blueprints, and overseeing the design process through all phases of the release lifecycle.\nDesigning, developing, and implementing data architecture solutions on GCP and Teradata to support our Telecom business.\nDesigning data ingestion for both real-time and batch processing, ensuring efficient and scalable data acquisition for creating an effective data warehouse.\nFormulating End to End data solutions (Authoritative Data Source, Data Protection, Taxonomy Alignment)\nMaintaining meticulous documentation, including data design specifications, functional test cases, data lineage, and other relevant artifacts for all data product solution assets.\nDefining Data Architecture Strategy (Enterprise & Domain level) and Enterprise Data Model Standards & Ownership\nProactively identifying opportunities for automation and performance optimization within your scope of work\nCollaborating effectively within a product-oriented organization, providing data expertise and solutions across multiple business units.\nCultivating strong cross-functional relationships and establish yourself as a subject matter expert in data and analytics within the organization.\nActing as a mentor to junior team members\n\n\nWhat we’re looking for...\n\nYou’re curious about new technologies and the game-changing possibilities it creates. You like to stay up-to-date with the latest trends and apply your technical expertise to solve business problems. You thrive in a fast-paced, innovative environment working as a phenomenal teammate to drive the best results and business outcomes.\n\nYou'll need to have…\n\n\nBachelor’s degree or four or more years of work experience.\nFour or more years of relevant work experience.\nFour or more years of relevant work experience in data architecture, data warehousing, or a related role.\nStrong grasp of data architecture principles, best practices, and methodologies.\nExpertise in SQL for data analysis, data discovery, data profiling and solution design.\nExperience defining data standards, data quality and implementing industry best practices for scalable and maintainable data models using data modeling tools like Erwin\nProven experience with ETL, data warehousing concepts, and the data management lifecycle\nSkilled in creating technical documentation, including source-to-target mappings and SLAs.\nExperience in shell scripting and python programming language\nUnderstanding of git version control and basic git command\nHands-on experience with cloud services relevant to data engineering and architecture (e.g., BigQuery, Dataflow, Dataproc, Cloud Storage).\n\n\nEven better if you have one or more of the following…\n\n\nMaster's degree in Computer Science.\nExperience in the Telecommunications industry, with knowledge of wireless and wireline business domains.\nExperience with stream-processing systems, API, Events etc.\nCertification in GCP-Data Engineer/Architect.\nAccuracy and attention to detail.\nGood problem solving, analytical, and research capabilities.\nGood verbal and written communication.\nExperience presenting to and influence stakeholders.\nExperience with large clusters, databases, BI tools, data quality and performance tuning.\nExperience in driving one or more smaller teams for technical delivery\n\n\nIf Verizon and this role sound like a fit for you, we encourage you to apply even if you don’t meet every “even better” qualification listed above.\n\n#AI&D\n\nWhere you’ll be working\n\nIn this hybrid role, you'll have a defined work location that includes work from home and assigned office days set by your manager.\n\nScheduled Weekly Hours\n\n40\n\nEqual Employment Opportunity\n\nVerizon is an equal opportunity employer. We evaluate qualified applicants without regard to race, gender, disability or any other legally protected characteristics.\nShow more "
  },
  {
    "job_id": "4275881967",
    "title": "Software Engineer",
    "company": "NetApp",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/software-engineer-at-netapp-4275881967?position=11&pageNum=0&refId=wQ76I2ig11brstfWA%2BFLpQ%3D%3D&trackingId=HYKPMt9ax1IihxxaaJKFbA%3D%3D",
    "description": "Job Summary\n\nAs Software Engineer, you will be responsible for coming up with a test design / strategy for qualifying a feature and to develop, automate and execute tests using the NetApp’s automation framework. This requirement is for the System Test Engineering group that is a centralized organization to test / qualify various features of ONTAP product line.\n\nJob Requirements\n\n\nRole is of “Software Development in Testing” (SDIT) that demands for a strong automation skill with a hands-on experience to be able to test & qualify a system under test.\nContribute to test methodologies, plans, and automation.\nA person should have a good understanding of test automation framework, scripting languages that enables the person to carry out automated tests who can triage & report issues.\nDesign, deploy, and maintain automated system tests to replicate real-world scenarios.\nUnderstand Functional specification and system architecture to properly design feature test plans.\nReview bug descriptions, functional requirements and design documents and incorporate them into test plans and cases.\nPossess strong communication skills who can articulate well to be able to work with an extended team consisting of developers and partner teams.\nWork with the support team to troubleshoot and reproduce customer impacting issues.\nProactive, positive attitude, a good team player, self-motivated and flexible.\nA person should be willing to work with partners across geographical locations who is expected to collaborate to deliver on commitments.\n\n\nTechnical Skills\n\n\nStrong Automation skillset who has hands on experience with Python is a must.\nBasic knowledge about storage/ storage protocols /cloud domain / K8s / Data protection techniques is preferable.\nBasic knowledge of Networking Protocols – TCP / IP, UDP / IP, VLAN etc. is preferable.\nExperience in QA / Testing\nFamiliarity with automation / testing frameworks\nSound knowledge in test design and test strategies\n\n\nEducation\n\nA Bachelor of Science Degree in Engineering or Computer Science with 2 years of experience, or a Master’s Degree; or equivalent experience is required.\n\nAt NetApp, we embrace a hybrid working environment designed to strengthen connection, collaboration, and culture for all employees. This means that most roles will have some level of in-office and/or in-person expectations, which will be shared during the recruitment process.\n\nEqual Opportunity Employer\n\nNetApp is firmly committed to Equal Employment Opportunity (EEO) and to compliance with all laws that prohibit employment discrimination based on age, race, color, gender, sexual orientation, gender identity, national origin, religion, disability or genetic information, pregnancy, and any protected classification.\n\nWhy NetApp?\n\nWe are all about helping customers turn challenges into business opportunity. It starts with bringing new thinking to age-old problems, like how to use data most effectively to run better - but also to innovate. We tailor our approach to the customer's unique needs with a combination of fresh thinking and proven approaches.\n\nWe enable a healthy work-life balance. Our volunteer time off program is best in class, offering employees 40 hours of paid time off each year to volunteer with their favourite organizations. We provide comprehensive benefits, including health care, life and accident plans, emotional support resources for you and your family, legal services, and financial savings programs to help you plan for your future. We support professional and personal growth through educational assistance and provide access to various discounts and perks to enhance your overall quality of life.\n\nIf you want to help us build knowledge and solve big problems, let's talk.\nShow more "
  },
  {
    "job_id": "4221075747",
    "title": "Software Engineer I - Frontend",
    "company": "Nirvana Insurance",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/software-engineer-i-frontend-at-nirvana-insurance-4221075747?position=12&pageNum=0&refId=wQ76I2ig11brstfWA%2BFLpQ%3D%3D&trackingId=wVhfeteRC8FIjwEAzhvTvQ%3D%3D",
    "description": "Who We Are\n\nNirvana is on a mission to harness the power of data to revolutionize commercial insurance and enable a safer world. We are bringing much-needed innovation into the legacy, trillion-dollar commercial insurance industry. We have developed cutting-edge predictive models that use real-time IoT data from billions of connected devices, allowing us to better understand and price risk. Our AI-driven platform fundamentally changes the way an insurance company operates with personalized risk scoring, faster underwriting, modernized claims, and proactive, data-driven insights to help customers prevent accidents.\n\nWe’ve already proven the scale—reaching well over $100 million in premiums and more than doubling year over year. Our data moat is growing exponentially with more than 20 billion miles of telematics data, leading to more predictive models and new insights into how we can better understand and reduce risk. Altogether, our loss ratio, efficiency, and customer experience are redefining what can be done in the industry.\n\nWith $170+ million raised, including an industry-leading Series C round in January 2025, we’re only accelerating our growth, with strong support from top-tier VCs including Lightspeed, General Catalyst, and Valor. Nirvana’s leadership team has previously helped scale multi-billion-dollar companies from scratch, including Samsara, Rubrik, and Flexport, and includes industry veterans from Hiscox, The Hartford, and RLI.\n\nAbout The Role\n\nAs a Frontend Engineer at Nirvana, you’ll play a key role in defining and building the user interface for our innovative insurance platform. Working closely with our product, design, and backend teams, you'll create engaging, efficient, and user-friendly web applications that help customers manage their insurance and safety operations effortlessly.\n\nYou will have a significant impact on the user experience and will contribute to shaping the frontend architecture, from the core framework to best practices, setting standards for the future of the platform.\n\nHere are some of the key areas you will work on as we take the product to market:\n\n\nUser-Centric Design: Develop responsive, intuitive, and accessible user interfaces that offer a seamless experience for customers engaging with our insurance and safety features.\nData Visualization: Design and implement dashboards that provide real-time insights from IoT data, including driving quality, vehicle health, and geospatial data.\nComponent Libraries: Build reusable, scalable UI components that streamline development while maintaining design consistency.\nCollaborative Workflows: Collaborate closely with backend engineers and designers to create user experiences that are functional, delightful, and effective.\n\n\nAbout You\n\nYou are passionate about delivering high-quality user experiences, crafting clean and maintainable code, and collaborating with diverse teams to achieve outstanding results. You thrive in environments where you can take ownership of the frontend stack and influence the product's direction.\n\n\nYou are a problem solver. You love breaking down complex user requirements and translating them into clean, efficient, and functional UIs.\nYou ship fast. You focus on shipping meaningful features rapidly while maintaining a high degree of quality and user satisfaction.\nYou have an eye for design. You care deeply about crafting elegant user interfaces and are passionate about UI/UX best practices.\nYou communicate clearly. You work well with both engineers and non-technical stakeholders, providing thoughtful code reviews and offering honest, constructive feedback.\nYou are adaptable. You embrace working on different parts of the UI stack and love tackling new challenges, even those outside your comfort zone.\n\n\nRequirements\n\n\n1+ years of experience building responsive, scalable web applications using modern JavaScript frameworks like React, Angular, or Vue.\nStrong proficiency with HTML, CSS, and JavaScript, with a deep understanding of building cross-browser, accessible web interfaces.\nExperience with Typescript will be preferable.\nExperience integrating frontend applications with backend services, including RESTful APIs.\nProficiency in building reusable component libraries and familiarity with design systems.\nKnowledge of modern React libraries like Tanstack, Material-ui, TailwindCSS, Vite, etc.\nExperience working in an agile environment, collaborating with designers and engineers.\n\n\nWhat You’ll Get From Us\n\n\nCompetitive compensation & meaningful equity\nMedical insurance\nMonthly Wellness stipend for anything that gives you joy\nHybrid culture and reimbursement for home office equipment\nA flexible vacation policy and a team that understands building a company is a marathon, not a sprint\nA culture that gives you the autonomy you need to do great work, and the transparency you need to make good decisions\n\n\nShow more "
  },
  {
    "job_id": "4249842843",
    "title": "Staff Engineer, Software Development Engineering (Apps)- C++, STL/Boost programming",
    "company": "Sandisk",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/staff-engineer-software-development-engineering-apps-c%2B%2B-stl-boost-programming-at-sandisk-4249842843?position=15&pageNum=0&refId=wQ76I2ig11brstfWA%2BFLpQ%3D%3D&trackingId=MJc%2B9HYXsUk9K2cbYnr6LA%3D%3D",
    "description": "Company Description\n\nSandisk understands how people and businesses consume data and we relentlessly innovate to deliver solutions that enable today’s needs and tomorrow’s next big ideas. With a rich history of groundbreaking innovations in Flash and advanced memory technologies, our solutions have become the beating heart of the digital world we’re living in and that we have the power to shape.\n\nSandisk meets people and businesses at the intersection of their aspirations and the moment, enabling them to keep moving and pushing possibility forward. We do this through the balance of our powerhouse manufacturing capabilities and our industry-leading portfolio of products that are recognized globally for innovation, performance and quality.\n\nSandisk has two facilities recognized by the World Economic Forum as part of the Global Lighthouse Network for advanced 4IR innovations. These facilities were also recognized as Sustainability Lighthouses for breakthroughs in efficient operations. With our global reach, we ensure the global supply chain has access to the Flash memory it needs to keep our world moving forward.\n\nJob Description\n\nEssential Duties and Responsibilities:\n\nMembers of the Software Tools Team work on design and implementation of tools for SSD products. Members of this team develop the in-house software tools used to interact with the SSDs and test their performance. Individual is expected to understand technical specifications (like protocol specs), design and implement features in the tools.\n\nQualifications\n\nMinimum Qualifications:\n\nRequired\n\n\nBE / B Tech / ME / M Tech / MS in Computer Science, Software Engineering, or Computer Engineering\n\n\nPreferred\n\n\nPrior experience with Windows driver development is nice to have.\nKnowledge of Python Language or any other scripting language is nice to have\nPrior experience working with storage protocols (SCSI, ATA, and NVMe).\n\n\nRequired Skills/Experience\n\n6-8 Years of relevant experience\n\n\nHands-on in C++, STL/Boost programming.\nStrong in data structures, design patterns.\nHands-on in multi-threaded design and programming.\nAbility to troubleshoot and debug complex issues.\nAble to work independently and perform in fast paced environment.\nPrior experience in working with Agile/Scrum.\n\n\nAdditional Information\n\nSandisk thrives on the power and potential of diversity. As a global company, we believe the most effective way to embrace the diversity of our customers and communities is to mirror it from within. We believe the fusion of various perspectives results in the best outcomes for our employees, our company, our customers, and the world around us. We are committed to an inclusive environment where every individual can thrive through a sense of belonging, respect and contribution.\n\nSandisk is committed to offering opportunities to applicants with disabilities and ensuring all candidates can successfully navigate our careers website and our hiring process. Please contact us at jobs.accommodations@sandisk.com to advise us of your accommodation request. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying.\nShow more "
  },
  {
    "job_id": "4272727888",
    "title": "Software Development Engineer II",
    "company": "Umanist NA",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/software-development-engineer-ii-at-umanist-na-4272727888?position=16&pageNum=0&refId=wQ76I2ig11brstfWA%2BFLpQ%3D%3D&trackingId=rz%2F86XTA7aJiy5ckEwB1vg%3D%3D",
    "description": "Position Title: Software Development Engineer II 137547\n\nLocation: Bangalore (Onsite)\n\nJob Type: Contract (8 Months)\n\nShift Timing: 9:00 AM to 6:00 PM\n\nBudget: Up to ₹27 LPA\n\nNotice Period: Immediate Joiners Only\n\nRole Overview\n\nWe are seeking a highly skilled Software Development Engineer II with strong technical acumen and a proven track record in software design, development, and operational execution. This role offers the opportunity to work in a fast-paced environment with a focus on delivering scalable and high-quality solutions.\n\nKey Responsibilities\n\n\nDesign, develop, test, and maintain scalable and high-performance software solutions\nContribute to architecture and design discussions for new applications and features\nDrive operational excellence by identifying and implementing improvements\nCollaborate with cross-functional teams to ensure smooth and timely project execution\n\n\nWhat We’re Looking For\n\n\n4+ years of hands-on experience in software development\nStrong foundation in Data Structures and Algorithms (DSA) and problem-solving\nSolid understanding of object-oriented design principles, system design, and coding best practices\nDemonstrated ability to dive deep into technical challenges and deliver innovative solutions\nStrong sense of ownership, a bias for action, and the ability to deliver results\n\n\nPreferred Qualities\n\n\nProven ability to work independently and in a team environment\nEffective communication skills to articulate complex technical ideas\nFamiliarity with agile development methodologies\n\n\nEducational Qualification\n\n\nBachelor’s degree in Engineering (or equivalent in Computer Science or related field)\n\n\nInterview Process\n\n\nGlider Assessment\n3 Rounds of Technical Interviews\n\n\nSkills: agile,problem-solving,software development,bias for action,agile development,data structures and algorithms,system design,communication,algorithms,object-oriented design principles,collaboration\nShow more "
  },
  {
    "job_id": "4234403464",
    "title": "Site Reliability Engineer - Big Data (5 to 7 years)",
    "company": "PhonePe",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/site-reliability-engineer-big-data-5-to-7-years-at-phonepe-4234403464?position=19&pageNum=0&refId=wQ76I2ig11brstfWA%2BFLpQ%3D%3D&trackingId=K%2BN1vh50Ow%2BqoJslpi5J1g%3D%3D",
    "description": "About PhonePe Limited:\n\nHeadquartered in India, its flagship product, the PhonePe digital payments app, was launched in Aug 2016. As of April 2025, PhonePe has over 60 Crore (600 Million) registered users and a digital payments acceptance network spread across over 4 Crore (40+ million) merchants. PhonePe also processes over 33 Crore (330+ Million) transactions daily with an Annualized Total Payment Value (TPV) of over INR 150 lakh crore.\n\nPhonePe’s portfolio of businesses includes the distribution of financial products (Insurance, Lending, and Wealth) as well as new consumer tech businesses (Pincode - hyperlocal e-commerce and Indus AppStore Localized App Store for the Android ecosystem) in India, which are aligned with the company’s vision to offer every Indian an equal opportunity to accelerate their progress by unlocking the flow of money and access to services.\n\nCulture:\n\nAt PhonePe, we go the extra mile to make sure you can bring your best self to work, Everyday!. And that starts with creating the right environment for you. We empower people and trust them to do the right thing. Here, you own your work from start to finish, right from day one. PhonePe-rs solve complex problems and execute quickly; often building frameworks from scratch. If you’re excited by the idea of building platforms that touch millions, ideating with some of the best minds in the country and executing on your dreams with purpose and speed, join us!\n\nAbout The Role\n\nAs an SRE (5 to 7 years) (Big Data) Engineer at PhonePe, you will be responsible for ensuring the stability, scalability, and performance of distributed systems operating at scale. You will collaborate with development, infrastructure, and data teams to automate operations, reduce manual efforts, handle incidents, and continuously improve system reliability. This role requires strong problem-solving skills, operational ownership, and a proactive approach to mentoring and driving engineering excellence.\n\nRoles And Responsibilities\n\n\nEnsure the ongoing stability, scalability, and performance of PhonePe’s Hadoop ecosystem and associated services.\nManage and administer Hadoop infrastructure including HDFS, HBase, Hive, Pig, Airflow, YARN, Ranger, Kafka, Pinot, and Druid.\nAutomate BAU operations through scripting and tool development.\nPerform capacity planning, system tuning, and performance optimization.\nSet-up, configure, and manage Nginx in high-traffic environments.\nAdministration and troubleshooting of Linux + Bigdata systems, including networking (IP, Iptables, IPsec).\nHandle on-call responsibilities, investigate incidents, perform root cause analysis, and implement mitigation strategies.\nCollaborate with infrastructure, network, database, and BI teams to ensure data availability and quality.\nApply system updates, patches, and manage version upgrades in coordination with security teams.\nBuild tools and services to improve observability, debuggability, and supportability.\nParticipate in Kerberos and LDAP administration.\nExperience in capacity planning and performance tuning of Hadoop clusters.\nWork with configuration management and deployment tools like Puppet, Chef, Salt, or Ansible.\n\n\nSkills Required\n\n\nMinimum 1 year of Linux/Unix system administration experience.\nOver 4 years of hands-on experience in Hadoop administration.\nMinimum 1 years of experience managing infrastructure on public cloud platforms like AWS, Azure, or GCP (optional ) .\nStrong understanding of networking, open-source tools, and IT operations.\nProficient in scripting and programming (Perl, Golang, or Python).\nHands-on experience with maintaining and managing the Hadoop ecosystem components like HDFS, Yarn, Hbase, Kafka .\nStrong operational knowledge in systems (CPU, memory, storage, OS-level troubleshooting).\nExperience in administering and tuning relational and NoSQL databases.\nExperience in configuring and managing Nginx in production environments.\nExcellent communication and collaboration skills.\n\n\nGood to Have\n\n\nExperience designing and maintaining Airflow DAGs to automate scalable and efficient workflows.\nExperience in ELK stack administration.\nFamiliarity with monitoring tools like Grafana, Loki, Prometheus, and OpenTSDB.\nExposure to security protocols and tools (Kerberos, LDAP).\nFamiliarity with distributed systems like elasticsearch or similar high-scale environments.\n\n\nPhonePe Full Time Employee Benefits (Not applicable for Intern or Contract Roles)\n\n\nInsurance Benefits - Medical Insurance, Critical Illness Insurance, Accidental Insurance, Life Insurance\nWellness Program - Employee Assistance Program, Onsite Medical Center, Emergency Support System\nParental Support - Maternity Benefit, Paternity Benefit Program, Adoption Assistance Program, Day-care Support Program\nMobility Benefits - Relocation benefits, Transfer Support Policy, Travel Policy\nRetirement Benefits - Employee PF Contribution, Flexible PF Contribution, Gratuity, NPS, Leave Encashment\nOther Benefits - Higher Education Assistance, Car Lease, Salary Advance Policy\n\n\nOur inclusive culture promotes individual expression, creativity, innovation, and achievement and in turn helps us better understand and serve our customers. We see ourselves as a place for intellectual curiosity, ideas and debates, where diverse perspectives lead to deeper understanding and better quality results. PhonePe is an equal opportunity employer and is committed to treating all its employees and job applicants equally; regardless of gender, sexual preference, religion, race, color or disability. If you have a disability or special need that requires assistance or reasonable accommodation, during the application and hiring process, including support for the interview or onboarding process, please fill out this form.\n\nRead more about PhonePe on our blog.\n\nLife at PhonePe\n\nPhonePe in the news\nShow more "
  },
  {
    "job_id": "4232872582",
    "title": "Site Reliability Engineer - Big Data (7 to 11 years)",
    "company": "PhonePe",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/site-reliability-engineer-big-data-7-to-11-years-at-phonepe-4232872582?position=20&pageNum=0&refId=wQ76I2ig11brstfWA%2BFLpQ%3D%3D&trackingId=sDKZrZy0qUG4bB9JAWRhvw%3D%3D",
    "description": "About PhonePe Limited:\n\nHeadquartered in India, its flagship product, the PhonePe digital payments app, was launched in Aug 2016. As of April 2025, PhonePe has over 60 Crore (600 Million) registered users and a digital payments acceptance network spread across over 4 Crore (40+ million) merchants. PhonePe also processes over 33 Crore (330+ Million) transactions daily with an Annualized Total Payment Value (TPV) of over INR 150 lakh crore.\n\nPhonePe’s portfolio of businesses includes the distribution of financial products (Insurance, Lending, and Wealth) as well as new consumer tech businesses (Pincode - hyperlocal e-commerce and Indus AppStore Localized App Store for the Android ecosystem) in India, which are aligned with the company’s vision to offer every Indian an equal opportunity to accelerate their progress by unlocking the flow of money and access to services.\n\nCulture:\n\nAt PhonePe, we go the extra mile to make sure you can bring your best self to work, Everyday!. And that starts with creating the right environment for you. We empower people and trust them to do the right thing. Here, you own your work from start to finish, right from day one. PhonePe-rs solve complex problems and execute quickly; often building frameworks from scratch. If you’re excited by the idea of building platforms that touch millions, ideating with some of the best minds in the country and executing on your dreams with purpose and speed, join us!\n\nAbout the Role:\n\nThis role is responsible for managing and maintaining complex, distributed big data ecosystems. It ensures the reliability, scalability, and security of large-scale production infrastructure. Key responsibilities include automating processes, optimizing workflows, troubleshooting production issues, and driving system improvements across multiple business verticals.\n\nRoles and Responsibilities:\n\n\nManage, maintain, and support incremental changes to Linux/Unix environments.\nLead on-call rotations and incident responses, conducting root cause analysis and driving postmortem processes.\nDesign and implement automation systems for managing big data infrastructure, including provisioning, scaling, upgrades, and patching clusters.\nTroubleshoot and resolve complex production issues while identifying root causes and implementing mitigating strategies.\nDesign and review scalable and reliable system architectures.\nCollaborate with teams to optimize overall system performance.\nEnforce security standards across systems and infrastructure.\nSet technical direction, drive standardization, and operate independently.\nEnsure availability, performance, and scalability of systems and services through proactive monitoring, maintenance, and capacity planning.\nResolve, analyze, and respond to system outages and disruptions and implement measures to prevent similar incidents from recurring.\nDevelop tools and scripts to automate operational processes, reducing manual workload, increasing efficiency and improving system resilience.\nMonitor and optimize system performance and resource usage, identify and address bottlenecks, and implement best practices for performance tuning.\nCollaborate with development teams to integrate best practices for reliability, scalability, and performance into the software development lifecycle.\nStay informed of industry technology trends and innovations, and actively contribute to the organization's technology communities.\nDevelop and enforce SRE best practices and principles.\nAlign across functional teams on priorities and deliverables.\nDrive automation to enhance operational efficiency.\n\n\nSkills Required:\n\n\nOver 7 years of experience managing and maintaining distributed big data ecosystems.\nStrong expertise in Linux including IP, Iptables, and IPsec.\nProficiency in scripting/programming with languages like Perl, Golang, or Python.\nHands-on experience with the Hadoop stack (HDFS, HBase, Airflow, YARN, Ranger, Kafka, Pinot).\nFamiliarity with open-source configuration management and deployment tools such as Puppet, Salt, Chef, or Ansible.\nSolid understanding of networking, open-source technologies, and related tools.\nExcellent communication and collaboration skills.\nDevOps tools: Saltstack, Ansible, docker, Git.\nSRE Logging and monitoring tools: ELK stack, Grafana, Prometheus, opentsdb, Open Telemetry.\n\n\nGood to Have:\n\n\nExperience managing infrastructure on public cloud platforms (AWS, Azure, GCP).\nExperience in designing and reviewing system architectures for scalability and reliability.\nExperience with observability tools to visualize and alert on system performance.\n\n\nPhonePe Full Time Employee Benefits (Not applicable for Intern or Contract Roles)\n\n\nInsurance Benefits - Medical Insurance, Critical Illness Insurance, Accidental Insurance, Life Insurance\nWellness Program - Employee Assistance Program, Onsite Medical Center, Emergency Support System\nParental Support - Maternity Benefit, Paternity Benefit Program, Adoption Assistance Program, Day-care Support Program\nMobility Benefits - Relocation benefits, Transfer Support Policy, Travel Policy\nRetirement Benefits - Employee PF Contribution, Flexible PF Contribution, Gratuity, NPS, Leave Encashment\nOther Benefits - Higher Education Assistance, Car Lease, Salary Advance Policy\n\n\nOur inclusive culture promotes individual expression, creativity, innovation, and achievement and in turn helps us better understand and serve our customers. We see ourselves as a place for intellectual curiosity, ideas and debates, where diverse perspectives lead to deeper understanding and better quality results. PhonePe is an equal opportunity employer and is committed to treating all its employees and job applicants equally; regardless of gender, sexual preference, religion, race, color or disability. If you have a disability or special need that requires assistance or reasonable accommodation, during the application and hiring process, including support for the interview or onboarding process, please fill out this form.\n\nRead more about PhonePe on our blog.\n\nLife at PhonePe\n\nPhonePe in the news\nShow more "
  },
  {
    "job_id": "4235365212",
    "title": "Embedded/Firmware Software Engineer",
    "company": "Arm",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/embedded-firmware-software-engineer-at-arm-4235365212?position=23&pageNum=0&refId=wQ76I2ig11brstfWA%2BFLpQ%3D%3D&trackingId=cg9sIi%2FbnC5X%2FYep00tMDg%3D%3D",
    "description": "The Software (CE-SW) group is responsible for developing and improving the software ecosystem around Arm's next generation of applications processors and IP. This means working with processors and other hardware technology not yet available to the public. You will join a team of Software Engineers who share a passion for leaving their mark on the future of computing.\n\nJob Overview\n\nWe are looking for highly capable engineers to work in the areas of Client/Server/Automotive, ready to use their knowledge and experience to ensure we continue to deliver software with the level of quality demanded by our customers. If you are similarly passionate about innovative technologies, then we want to hear from you!\n\nResponsibilities\n\n\nActive involvement in the software design of reference application processor firmware.\nYour day to day role will involve low level software development, test and debug on various platforms, including software models, development boards and shipping products.\nCreating software stacks for Arm’s reference platforms for future Arm devices.\nWe want you to be able to analyse industry specs, roadmap requirements, breakdown tasks and help implement the project plans.\nYour activities will involve upstreaming and maintenance.\n\n\nRequired Skills and Experience\n\n\n6+ Years work experience + University degree (or equivalent experience), ideally in a numerate subject.\nExcellent C/C++ programming skills with the ability to add significant new functionality, analyse and fix complex defects. Some knowledge of assembly and strong debugging skills are preferred.\nExpertise in application and low-level systems, with a strong understanding of system architecture (preferably ARM), OS fundamentals, bootloaders, and device drivers. Proficiency in Linux/Windows operating systems and driver development is preferred.\nStrong interpersonal skills; excellent written and spoken English.\n\n\n“Nice To Have” Skills and Experience\n\n\nFamiliarity with open-source project development cycles and contribution processes.\nExperience of software profiling, instrumentation, and optimization.\nVerification and validation of firmware on both pre-silicon and post-silicon platforms.\nA knowledge of how to test software using various techniques alongside an awareness of the value of CI and automated test systems.\nFamiliarity and flexibility in the use of various software development lifecycle methods including Agile.\n\n\nIn Return\n\nYou will have the opportunity to learn about the latest Arm architecture features, working closely with highly skilled engineering teams on ground-breaking technology. You will be empowered to continually identify and roll out improvements to our ways of working.\n\nAccommodations at Arm\n\nAt Arm, we want to build extraordinary teams. If you need an adjustment or an accommodation during the recruitment process, please email accommodations@arm.com . To note, by sending us the requested information, you consent to its use by Arm to arrange for appropriate accommodations. All accommodation or adjustment requests will be treated with confidentiality, and information concerning these requests will only be disclosed as necessary to provide the accommodation. Although this is not an exhaustive list, examples of support include breaks between interviews, having documents read aloud, or office accessibility. Please email us about anything we can do to accommodate you during the recruitment process.\n\nHybrid Working at Arm\n\nArm’s approach to hybrid working is designed to create a working environment that supports both high performance and personal wellbeing. We believe in bringing people together face to face to enable us to work at pace, whilst recognizing the value of flexibility. Within that framework, we empower groups/teams to determine their own hybrid working patterns, depending on the work and the team’s needs. Details of what this means for each role will be shared upon application. In some cases, the flexibility we can offer is limited by local legal, regulatory, tax, or other considerations, and where this is the case, we will collaborate with you to find the best solution. Please talk to us to find out more about what this could look like for you.\n\nEqual Opportunities at Arm\n\nArm is an equal opportunity employer, committed to providing an environment of mutual respect where equal opportunities are available to all applicants and colleagues. We are a diverse organization of dedicated and innovative individuals, and don’t discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\n\nShow more "
  },
  {
    "job_id": "4233006243",
    "title": "Core Engineering - CTL Engineering - Software Engineer - Associate",
    "company": "Goldman Sachs",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/core-engineering-ctl-engineering-software-engineer-associate-at-goldman-sachs-4233006243?position=24&pageNum=0&refId=wQ76I2ig11brstfWA%2BFLpQ%3D%3D&trackingId=zf%2FRSgvILJMvWRXIyz4HKw%3D%3D",
    "description": "Job Description\n\nWhat We Do\n\nAt Goldman Sachs, our Engineers don’t just make things – we make things possible. Change the world by connecting people and capital with ideas. Solve the most challenging and pressing engineering problems for our clients. Join our engineering teams that build massively scalable software and systems, architect low latency infrastructure solutions, proactively guard against cyber threats, and leverage machine learning alongside financial engineering to continuously turn data into action. Create new businesses, transform finance, and explore a world of opportunity at the speed of markets.\n\nEngineering, which is comprised of our Technology Division and global strategists groups, is at the critical center of our business, and our dynamic environment requires innovative strategic thinking and immediate, real solutions. Want to push the limit of digital possibilities? Start here.\n\nWho We Look For\n\nGoldman Sachs Engineers are innovators and problem-solvers, building solutions in risk management, big data, mobile and more. We look for creative collaborators who evolve, adapt to change and thrive in a fast-paced global environment.\n\nThe Project.\n\nWe have embarked on a highly ambitious, visible and impactful project which wholly reimagines the functional architecture needed to support the firm’s trading business and to empower the next two decades of growth by developing an extensible and scalable platform which also delivers operational efficiencies. This multi-year effort is based around an engineering-principles-first approach and dovetails with the firm’s core technology strategy.\n\nThe Role.\n\nWe are looking for engineers to work on both the infrastructure side of the project as well as on developing the core business model and the services around it.\n\nOn the Infrastructure side of the project, the work consists of establishing the capabilities of the platform, as well as developing the development environment which will form the basis for other engineers’ experience with the platform.\n\nOn the Core Business side of the project, the work consists of establishing an extensible model that can easily and seamlessly represent all of the firm’s business; of developing core services for that business model and collaborating with engineers in the business teams to develop their services on top of the core services.\n\nYour Impact\n\nAs you build an innate understanding of the firm’s businesses, you will be responsible for developing core models and services, and deep collaboration with engineers both in the team and in other teams across the firm. By taking a principled approach to that development, you will deliver a constellation of services that can be both maintained as well as extended at minimal cost.\n\nYou will fulfil your potential by\n\n\nBuilding software services and libraries to provide business and/or platform functionality with security and maintainability built-in at the core\nPartnering with other engineers and firm experts to understand and develop models for representing the firm’s business\nInnovating creative solutions to complex business problems, and…\nInfluencing broadly across teams to challenge entrenched practices\nManaging the full lifecycle of software components from requirements through design, testing, development, release and demise.\nEngaging in production troubleshooting, mitigation and remediation\n\n\nBasic Qualifications\n\n\nJava proficiency. 2 years+ experience\nExperience with Distributed systems\nSound SDLC and practices and tooling experience; version control, CI/CD\nThe ability to understand and effectively debug both new and old software\nThe ability to communicate technical concepts effectively, both written and orally,\nStrong teamworking and collaboration skills required to be effective with diverse and geographically distributed teams\n\n\nPreferred Qualifications\n\n\nCloud technologies, specifically GCP\nContainerization, specifically Kubernetes\nExperience with open source\nExperience monitoring, measuring, auditing and supporting software\n\n\nAbout Goldman Sachs\n\nAt Goldman Sachs, we commit our people, capital and ideas to help our clients, shareholders and the communities we serve to grow. Founded in 1869, we are a leading global investment banking, securities and investment management firm. Headquartered in New York, we maintain offices around the world.\n\nWe believe who you are makes you better at what you do. We're committed to fostering and advancing diversity and inclusion in our own workplace and beyond by ensuring every individual within our firm has a number of opportunities to grow professionally and personally, from our training and development opportunities and firmwide networks to benefits, wellness and personal finance offerings and mindfulness programs. Learn more about our culture, benefits, and people at GS.com/careers.\n\nWe’re committed to finding reasonable accommodations for candidates with special needs or disabilities during our recruiting process. Learn more: https://www.goldmansachs.com/careers/footer/disability-statement.html\n\n© The Goldman Sachs Group, Inc., 2023. All rights reserved.\n\nGoldman Sachs is an equal employment/affirmative action employer Female/Minority/Disability/Veteran/Sexual Orientation/Gender Identity\nShow more "
  },
  {
    "job_id": "4270396275",
    "title": "Operations Support System Engineer",
    "company": "Marutee",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/operations-support-system-engineer-at-marutee-4270396275?position=25&pageNum=0&refId=wQ76I2ig11brstfWA%2BFLpQ%3D%3D&trackingId=umeWVt%2F6E%2FAvVP1RU4Io8Q%3D%3D",
    "description": "The role is responsible for\n\nHardworking and willing to accept overtime obligations.\nAcquainted with image processing tools commonly used in visual algorithms and capable of completing drawing template operations as instructed by engineers.\n\n\n\n\nEducation\n\nB.E./Diploma in – Mech / EEE, E&I and Mechatronics\nBE – 2-4 Yrs Exp.\nDiploma 4-7 Yrs Exp in Operations Support System Engineer\n\nRelevant Experience\n\nPreferably possess relevant experience in industrial machines, particularly in Dispensing, Pick and Place machines, and Laser machines.\nProficient in PLC with experience in ladder diagram programming and debugging projects.\nPossess 1 year or more experience in visual debugging, including familiarity with visual and robot calibration operations.\nRead and comprehend various circuit schematics, familiar with design specifications and standards, understand PLC programs like ladder diagrams and C# language, and be proficient in panel wiring circuits.\n\nBehavioral Skills\n\nAdopt to factory environment and should be flexible for extended work hours based on business requirement.\nShould possess effective communication skills, and the ability to engage with people.\nPossess knowledge of the structure of various types of automation equipment, capable of independently analyzing and troubleshooting electrical and software issues, and swiftly solving them.\nFamiliar with the principles and troubleshooting of common electrical components and pneumatic systems, skilled in operating instruments and handling tools such as soldering equipment, multimeters, pressure testers, etc.\n\n\n\n\nKnowledge\n\nProficient in office software, with a good command of English; proficiency in Chinese is advantageous.\nKnowledgeable in PLC, CCD, and common vision hardware such as cameras, light sources, and lenses.\nAcquainted with computer hardware and operating software systems, responsible for equipment debugging, process optimization, and maintenance.\nCapable of identifying problems and coordinating prompt solutions, skilled in summarizing encountered problems and their solutions, and reporting to the relevant department PM or Team Leader.\nCandidate should possess Machine Assembly & testing skill along with\nGood Knowledge on Pneumatics & Hydraulics\nHave hand on with QC tools(Six sigma, Cp, Cpk) and experienced in Troubleshooting & Commissioning\n\nShow more "
  },
  {
    "job_id": "4270824893",
    "title": "Software Engineer - ERP",
    "company": "Cargill",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/software-engineer-erp-at-cargill-4270824893?position=28&pageNum=0&refId=wQ76I2ig11brstfWA%2BFLpQ%3D%3D&trackingId=kW%2FJ5MOvu%2FMPArHs84mHtg%3D%3D",
    "description": "Job Purpose and Impact\n\n\nThe Software Engineering- ERP job maintains and partners to design and develop software applications and systems. With limited supervision, this job collaborates with cross functional teams to implement new software features to meet user needs and business goals and upgrade existing software to improve performance and functionality through writing clean, efficient and scalable code and troubleshooting and debugging moderately complex issues. This job also participates in code reviews to maintain high code quality and share knowledge with software engineering team members.\n\n\nKey Accountabilities\n\n\nSOFTWARE DEVELOPMENT: Partners to design and develop high quality software solutions by writing clean, maintainable and efficient codes.\nAUTOMATION: Applies internal software deployment platform, methodologies and tools to automate the deployment process, ensuring smooth and reliable releases.\nCOLLABORATION: Partners with cross functional team of product managers, designers and other engineers to gather moderately complex requirements and deliver solutions that meet business needs.\nTESTING & DEBUGGING: Writes and maintains moderately complex unit tests and integration tests, and performs debugging to maintain the quality and performance of the software.\nCONTINUOUS IMPROVEMENT: Makes suggestions for improving the software development and deployment processes, and implements the approved standards to improve efficiency and reliability.\nDOCUMENTATION: Drafts and maintains comprehensive documentation for moderately complex software applications, deployment processes and system configurations.\nTECHNICAL SUPPORT: Provides technical support and troubleshooting for moderately complex issues with deployed applications to ensure minimal downtime and fast resolution.\n\n\nQualifications\n\n\nMinimum requirement of 2 years of relevant work experience. Typically reflects 3 years or more of relevant experience.\nShow more "
  },
  {
    "job_id": "4262238454",
    "title": "Junior Data Scientist",
    "company": "AB InBev GCC India",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/junior-data-scientist-at-ab-inbev-gcc-india-4262238454?position=29&pageNum=0&refId=wQ76I2ig11brstfWA%2BFLpQ%3D%3D&trackingId=yTbUsMOBpeti0LXjGQ4Cww%3D%3D",
    "description": "Dreaming big is in our DNA. It’s who we are as a company. It’s our culture. It’s our heritage. And more than ever, it’s our future. A future where we’re always looking forward. Always serving up new ways to meet life’s moments. A future where we keep dreaming bigger. We look for people with passion, talent, and curiosity, and provide them with the teammates, resources and opportunities to unleash their full potential. The power we create together – when we combine your strengths with ours – is unstoppable. Are you ready to join a team that dreams as big as you do?\n\nAB InBev GCC was incorporated in 2014 as a strategic partner for Anheuser-Busch InBev. The center leverages the power of data and analytics to drive growth for critical business functions such as operations, finance, people, and technology. The teams are transforming Operations through Tech and Analytics.\n\nDo You Dream Big?\n\nWe Need You.\n\nJob Title: Data Scientist\n\nLocation: Bangalore\n\nReporting to: Manager- Analytics/ Senior Manager-Analytics\n\n\nPurpose of the role\n\nContributing to the Data Science efforts of AB InBevʼs global non-commercial analytics capability of Procurement Analytics. Candidate will be required to contribute and may also need to guide the DS team staffed on the area and assess the efforts required to scale and standardize the use of Data Science across multiple ABI markets\n\n\nKEY TASKS AND ACCOUNTABILITIES\nUnderstand the business problem and translate that to an analytical problem; participate in the solution design process.\nManage the full AI/ML lifecycle, including data preprocessing, feature engineering, model training, validation, deployment, and monitoring.\nDevelop reusable and modular Python code adhering to OOP (Object-Oriented Programming) principles.\nDesign, develop, and deploy machine learning models into production environments on Azure.\nCollaborate with data scientists, software engineers, and other stakeholders to meet business needs.\nAbility to communicate findings clearly to both technical and business stakeholders.\n3. Qualifications, Experience, Skills\n\n\nLevel of educational attainment required (1 or more of the following)\n\nB.Tech /BE/ Masters in CS/IS/AI/ML\n\nPrevious Work Experience Required\n\nMinimum 3 years of relevant experience\n\nTechnical Skills Required\n\nMust Have\n\n\nStrong expertise in Python, including advanced knowledge of OOP concepts.\nExposure to AI/ML methodologies with a previous hands-on experience in ML concepts like forecasting, clustering, regression, classification, optimization, deep learning , NLP using Python\nSolid understanding of GenAI concepts and experience in Prompt Engineering and RAG\nExperience with version control tools such as Git.\nConsistently display an intent for problem solving\nStrong communication skills (vocal and written)\nAbility to effectively communicate and present information at various levels of an organization\n\n\nGood To Have\n\n\nPreferred industry exposure in CPG and experience of working in the domain of Procurement Analytics\nProduct building experience would be a plus\nFamiliarity with Azure Tech Stack, Databricks, ML Flow in any cloud platform\nExperience with Airflow for orchestrating and automating workflows\nFamiliarity with MLOPS and containerization tools like Docker would be plus.\n\nOther Skills Required\n\n\nPassion for solving problems using data\nDetail oriented, analytical and inquisitive\nAbility to learn on the go\nAbility to work independently and with others\n\nWe dream big to create future with more cheers\nShow more "
  },
  {
    "job_id": "4233549519",
    "title": "WFM Specialist",
    "company": "LSEG",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/wfm-specialist-at-lseg-4233549519?position=33&pageNum=0&refId=wQ76I2ig11brstfWA%2BFLpQ%3D%3D&trackingId=4bvlfALC4xzA0QCtRetmaA%3D%3D",
    "description": "Role Responsibilities & Key Accountabilities:\n\n\nPerforms data investigation on diagnostic, descriptive, and statistical output during the course of research projects\nParticipates in the development of new business proposals and assists on other on-going project work\nOversees and reviews the work of Analysts, helping to train and develop them\nLeverages specific market / language skills to deliver on customer / business requirements, adhering to the quality metrics set\nLeads in the resolution of client cases by fixing the data integrity, missing data and other similar issues\nProcesses data in an accurate and timely manner using the knowledge of the tools and financial markets or compliance industry\nUses the approved sources to identify the data, convert / add value to the data or use the data as is defined in the collection policy\nCollaborates with internal teams and external teams to support sourcing and collection of data\nSupports specific complex projects assigned and meets or exceeds the KPIs defined\nSupports the implementation of process improvement ideas to improve efficiency and customer experience.\n\n\nQualifications & Experience:\n\n\nBachelor's degree or equivalent\nRelevant experience in Languages and/ or Financial Markets or industry expertise.\n\n\nLSEG is a leading global financial markets infrastructure and data provider. Our purpose is driving financial stability, empowering economies and enabling customers to create sustainable growth.\n\nOur purpose is the foundation on which our culture is built. Our values of Integrity, Partnership, Excellence and Change underpin our purpose and set the standard for everything we do, every day. They go to the heart of who we are and guide our decision making and everyday actions.\n\nWorking with us means that you will be part of a dynamic organisation of 25,000 people across 65 countries. However, we will value your individuality and enable you to bring your true self to work so you can help enrich our diverse workforce. You will be part of a collaborative and creative culture where we encourage new ideas and are committed to sustainability across our global business. You will experience the critical role we have in helping to re-engineer the financial ecosystem to support and drive sustainable economic growth. Together, we are aiming to achieve this growth by accelerating the just transition to net zero, enabling growth of the green economy and creating inclusive economic opportunity.\n\nLSEG offers a range of tailored benefits and support, including healthcare, retirement planning, paid volunteering days and wellbeing initiatives.\n\nWe are proud to be an equal opportunities employer. This means that we do not discriminate on the basis of anyone’s race, religion, colour, national origin, gender, sexual orientation, gender identity, gender expression, age, marital status, veteran status, pregnancy or disability, or any other basis protected under applicable law. Conforming with applicable law, we can reasonably accommodate applicants' and employees' religious practices and beliefs, as well as mental health or physical disability needs.\n\nPlease take a moment to read this privacy notice carefully, as it describes what personal information London Stock Exchange Group (LSEG) (we) may hold about you, what it’s used for, and how it’s obtained, your rights and how to contact us as a data subject.\n\nIf you are submitting as a Recruitment Agency Partner, it is essential and your responsibility to ensure that candidates applying to LSEG are aware of this privacy notice.\nShow more "
  },
  {
    "job_id": "4260923879",
    "title": "Functional Lead - Divisional Insights",
    "company": "LSEG",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/functional-lead-divisional-insights-at-lseg-4260923879?position=34&pageNum=0&refId=wQ76I2ig11brstfWA%2BFLpQ%3D%3D&trackingId=Y8SL3DuT8nkoEfvOnSc2vA%3D%3D",
    "description": "Position Summary\n\nWorking within Metrics Office Performance & Insights team, this Functional Lead role will support Division aligned insights, building a deep understanding of these groups and acting as a consultative partner on behalf of the Metrics Office.\n\nThe role has two main focuses. Acting as a key gateway for Operations into the Divisions and Business Units, working closely with senior Operations leaders and leaders in the divisions to provide insights, track shared objectives and highlight initiatives. Secondly, working with senior leaders within Operations to collect, review and analyze key metrics and insights for Quarterly and Monthly Business Reviews.\n\nThe role requires strong interpersonal and communication skills – working with Operations, Division and Business Unit leaders, our colleagues in Metrics Office and wider Performance Office. This role will be pivotal in the conveying overall operations success with the Divisions, Engineering and Risk!\n\nResponsibilities / Accountabilities\n\n\nCreation and ownership of quarterly business review decks, ensuring alignment to key messages for quarter, tracking actions and progress against actions.\nProvide ongoing updates for shared objectives across COO and Divisions where appropriate.\nCultivate a deep understanding of each COO team objectives, business processes, and capabilities.\nWork closely with the Metrics Office team on Operations specific insight generation, deep dives, product analysis.\nLeading creation and continuous improvement of key Division/Business Unit focused Dashboards\nDeepen the value of our reporting to Business Unit, analyzing multiple sources (operational and performance data, voice of the customer, etc) to (a) understand the drivers of customer experience and (b) recommend potential product/proposition\nPartner with our colleagues in Metrics Office (Analytics & Reporting, Workforce Enablement) to identify the right expertise to support each request & bringing them into the relevant scoping discussions\n\n\nQualifications/Capabilities\n\n\nCandidate must possess at least a Bachelor's/College Degree, any field.\nFamiliarity with analytics, defining Key Performance Incidators/Metric measurements, data analysis and visualization.\nExperience handling and crafting outstanding dashboards an advantage.\nAbility to work proactively, with strong interpersonal skills across all levels of staff.\nMust be self-motivated, resourceful, multifaceted (able to respond to changing priorities) and able to work with minimal direction within a distributed team.\nExcellent verbal and written communication skills.\nUnderstanding of Customer Proposition & Refinitiv structures.\nStrong Microsoft office knowledge (excel, PowerPoint).\nMust be prepared to work UK/US hours as and when required.\n\n\nLSEG is a leading global financial markets infrastructure and data provider. Our purpose is driving financial stability, empowering economies and enabling customers to create sustainable growth.\n\nOur purpose is the foundation on which our culture is built. Our values of Integrity, Partnership, Excellence and Change underpin our purpose and set the standard for everything we do, every day. They go to the heart of who we are and guide our decision making and everyday actions.\n\nWorking with us means that you will be part of a dynamic organisation of 25,000 people across 65 countries. However, we will value your individuality and enable you to bring your true self to work so you can help enrich our diverse workforce. You will be part of a collaborative and creative culture where we encourage new ideas and are committed to sustainability across our global business. You will experience the critical role we have in helping to re-engineer the financial ecosystem to support and drive sustainable economic growth. Together, we are aiming to achieve this growth by accelerating the just transition to net zero, enabling growth of the green economy and creating inclusive economic opportunity.\n\nLSEG offers a range of tailored benefits and support, including healthcare, retirement planning, paid volunteering days and wellbeing initiatives.\n\nWe are proud to be an equal opportunities employer. This means that we do not discriminate on the basis of anyone’s race, religion, colour, national origin, gender, sexual orientation, gender identity, gender expression, age, marital status, veteran status, pregnancy or disability, or any other basis protected under applicable law. Conforming with applicable law, we can reasonably accommodate applicants' and employees' religious practices and beliefs, as well as mental health or physical disability needs.\n\nPlease take a moment to read this privacy notice carefully, as it describes what personal information London Stock Exchange Group (LSEG) (we) may hold about you, what it’s used for, and how it’s obtained, your rights and how to contact us as a data subject.\n\nIf you are submitting as a Recruitment Agency Partner, it is essential and your responsibility to ensure that candidates applying to LSEG are aware of this privacy notice.\nShow more "
  },
  {
    "job_id": "4217337861",
    "title": "Reporting Lead - Workflow Reporting",
    "company": "LSEG",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/reporting-lead-workflow-reporting-at-lseg-4217337861?position=35&pageNum=0&refId=wQ76I2ig11brstfWA%2BFLpQ%3D%3D&trackingId=u8jo9gI1jX8%2BTHJvF8%2FQbQ%3D%3D",
    "description": "The Reporting Lead will support reporting requirement in Customer implementation services// Order Management as a part o Operations enablement team to help build method of works that drives report simplification and efficiency. This role will partner with the Technology team and will be responsible for monitoring, crafting, and sending various reports/dashboards related operations.\n\nRole Responsibilities & Key Accountabilities:\n\n\nWorks closely to ensure data stores and applications implement to defined data management and data access practices, policies, and procedures\nProvides sophisticated reports, with both quantitative / qualitative analysis, analysing large data-sets, for internal or external reports\nLeads requests from clients, collaborating closely with Analytics teams across different geographies to ensure co-ordination and consistent data reporting across the Group\nOwns the training and development for junior staff, improving the knowledge of the team\nTranslates business needs into data analysis and reporting solutions, and automates requests where appropriate and efficient\nCollect, extract, analyse, interpret and report key data from sophisticated data sets\nOwn the automation development from lead to implementation\nDefine technical requirements and build high level specifications to ensure feasibility, functionality and integration of automation\nSupports the build of systems and processes to transform raw data into actionable business insights and intellectual property\nHelps to develop strategies for effective data analytics and management of data sources, for internal and external purposes\nApplies industry knowledge to interpret data and improve performance, working closely with Business Development to ensure clients are satisfied with their products and services\nKnowledge of Accounts payable/cash apps/billing/Account Receivable preferable\nCustomer management\nBackup for manager\nIndependently handle projects\n\n\nQualifications & Experience:\n\n\nEngineering Degree or equivalent experience\nhands on Experience in SQL/Power BI/ power Apps// database knowledge preferably oracle/SAP//snowflake\nPython (preferable)\nCustomer implementation /Order Management/accounts payable/collections/billing /compliance knowledge preferable\nExperience with database use, database platforms and analysing large datasets\nPrevious experience working in report generation, modelling, and trend forecasting\n\n\nSoft Skills:\n\n\nGood Communication and presentation skills\nHighly driven, upbeat, flexible, resourceful and ability to multitask\nClarity of thoughts and vision\nAbility to conceptualize and bring solutions to the table\nAlignment to timeliness, without sacrificing the quality of output\nHands on and detail oriented, with a good ability to coordinate across different geographies and with different custom\n\n\nLSEG is a leading global financial markets infrastructure and data provider. Our purpose is driving financial stability, empowering economies and enabling customers to create sustainable growth.\n\nOur purpose is the foundation on which our culture is built. Our values of Integrity, Partnership, Excellence and Change underpin our purpose and set the standard for everything we do, every day. They go to the heart of who we are and guide our decision making and everyday actions.\n\nWorking with us means that you will be part of a dynamic organisation of 25,000 people across 65 countries. However, we will value your individuality and enable you to bring your true self to work so you can help enrich our diverse workforce. You will be part of a collaborative and creative culture where we encourage new ideas and are committed to sustainability across our global business. You will experience the critical role we have in helping to re-engineer the financial ecosystem to support and drive sustainable economic growth. Together, we are aiming to achieve this growth by accelerating the just transition to net zero, enabling growth of the green economy and creating inclusive economic opportunity.\n\nLSEG offers a range of tailored benefits and support, including healthcare, retirement planning, paid volunteering days and wellbeing initiatives.\n\nWe are proud to be an equal opportunities employer. This means that we do not discriminate on the basis of anyone’s race, religion, colour, national origin, gender, sexual orientation, gender identity, gender expression, age, marital status, veteran status, pregnancy or disability, or any other basis protected under applicable law. Conforming with applicable law, we can reasonably accommodate applicants' and employees' religious practices and beliefs, as well as mental health or physical disability needs.\n\nPlease take a moment to read this privacy notice carefully, as it describes what personal information London Stock Exchange Group (LSEG) (we) may hold about you, what it’s used for, and how it’s obtained, your rights and how to contact us as a data subject.\n\nIf you are submitting as a Recruitment Agency Partner, it is essential and your responsibility to ensure that candidates applying to LSEG are aware of this privacy notice.\nShow more "
  },
  {
    "job_id": "4272769877",
    "title": "Azure Databricks Data Engineer/Developer",
    "company": "Infosys",
    "location": "Bengaluru East, Karnataka, India",
    "date": "2025-07-27",
    "link": "https://in.linkedin.com/jobs/view/azure-databricks-data-engineer-developer-at-infosys-4272769877?position=5&pageNum=0&refId=mM%2BrJCuQNTD1BFzX6JGUaQ%3D%3D&trackingId=m8cgPoRiN2xb1UKbsUDMog%3D%3D",
    "description": "Primary skills:Technology->Cloud Platform->Azure Development & Solution Architecting\n\nA day in the life of an Infoscion\n\n\nAs part of the Infosys delivery team, your primary role would be to interface with the client for quality assurance, issue resolution and ensuring high customer satisfaction.\nYou will understand requirements, create and review designs, validate the architecture and ensure high levels of service offerings to clients in the technology domain.\nYou will participate in project estimation, provide inputs for solution delivery, conduct technical risk planning, perform code reviews and unit test plan reviews.\nYou will lead and guide your teams towards developing optimized high quality code deliverables, continual knowledge management and adherence to the organizational guidelines and processes.\nYou would be a key contributor to building efficient programs/ systems and if you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! Knowledge of more than one technology\nBasics of Architecture and Design fundamentals\nKnowledge of Testing tools\nKnowledge of agile methodologies\nUnderstanding of Project life cycle activities on development and maintenance projects\nUnderstanding of one or more Estimation methodologies, Knowledge of Quality processes\nBasics of business domain to understand the business requirements\nAnalytical abilities, Strong Technical Skills, Good communication skills\nGood understanding of the technology and domain\nAbility to demonstrate a sound understanding of software quality assurance principles, SOLID design principles and modelling methods\nAwareness of latest technologies and trends\nExcellent problem solving, analytical and debugging skills\nShow more "
  },
  {
    "job_id": "4235793636",
    "title": "Software Engineer (7-10yrs)",
    "company": "PhonePe",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/software-engineer-7-10yrs-at-phonepe-4235793636?position=9&pageNum=0&refId=mM%2BrJCuQNTD1BFzX6JGUaQ%3D%3D&trackingId=%2Fg%2BvI8bi%2FGpNr0SlU1UPeg%3D%3D",
    "description": "About PhonePe Limited:\n\nHeadquartered in India, its flagship product, the PhonePe digital payments app, was launched in Aug 2016. As of April 2025, PhonePe has over 60 Crore (600 Million) registered users and a digital payments acceptance network spread across over 4 Crore (40+ million) merchants. PhonePe also processes over 33 Crore (330+ Million) transactions daily with an Annualized Total Payment Value (TPV) of over INR 150 lakh crore.\n\nPhonePe’s portfolio of businesses includes the distribution of financial products (Insurance, Lending, and Wealth) as well as new consumer tech businesses (Pincode - hyperlocal e-commerce and Indus AppStore Localized App Store for the Android ecosystem) in India, which are aligned with the company’s vision to offer every Indian an equal opportunity to accelerate their progress by unlocking the flow of money and access to services.\n\nCulture:\n\nAt PhonePe, we go the extra mile to make sure you can bring your best self to work, Everyday!. And that starts with creating the right environment for you. We empower people and trust them to do the right thing. Here, you own your work from start to finish, right from day one. PhonePe-rs solve complex problems and execute quickly; often building frameworks from scratch. If you’re excited by the idea of building platforms that touch millions, ideating with some of the best minds in the country and executing on your dreams with purpose and speed, join us!\n\nChallenges\n\nBuilding for Scale, Rapid Iterative Development, and Customer-centric Product Thinking at each step defines every day for a developer at PhonePe. Though we engineer for a 50million+ strong user base, we code with every individual user in mind. While we are quick to adopt the latest in Engineering, we care utmost for security, stability, and automation. Apply if you want to experience the best combination of passionate application development and product-driven thinking\n\nAs a Software Engineer:\n\n\n7+ years of experience in the art of writing code and solving problems on a Large Scale.\nYou will build Robust and scalable web-based applications You will need to think of platforms & reuse\nBuild abstractions and contracts with separation of concerns for a larger scope\nDrive problem-solving skills for high-level business and technical problems.\nDo high-level design with guidance; Functional modeling, break-down of a module\nDo incremental changes to architecture: impact analysis of the same\nDo performance tuning and improvements in large scale distributed systems\nMentor young minds and foster team spirit, break down execution into phases to bring predictability to overall execution\nWork closely with Product Manager to derive capability view from features/solutions, Lead execution of medium-sized projects\nWork with broader stakeholders to track the impact of projects/features and proactively iterate to improve them As a senior software engineer you must have\nExtensive and expert programming experience in at least one general programming language (e.g. Java, C, C++) & tech stack to write maintainable, scalable, unit-tested code.\nExperience with multi-threading and concurrency programming\nExtensive experience in object-oriented design skills, knowledge of design patterns, and huge passion and ability to design intuitive module and class-level interfaces\nExcellent coding skills – should be able to convert the design into code fluently\nKnowledge of Test Driven Development\nGood understanding of databases (e.g. MySQL) and NoSQL (e.g. HBase, Elasticsearch, Aerospike, etc)\nStrong desire to solving complex and interesting real-world problems\nExperience with full life cycle development in any programming language on a Linux platform\nGo-getter attitude that reflects in energy and intent behind assigned tasks\nWorked in a startups environment with high levels of ownership and commitment\nBTech, MTech, or Ph.D. in Computer Science or related technical discipline (or equivalent).\nExperience in building highly scalable business applications, which involve implementing large complex business flows and dealing with a huge amount of data.\nAn open communicator who shares thoughts and opinions frequently listens intently and takes constructive feedback.\n\n\nAs a Software Engineer, good to have\n\n\nThe ability to drive the design and architecture of multiple subsystems\nAbility to break-down larger/fuzzier problems into smaller ones in the scope of the product\nUnderstanding of the industry’s coding standards and an ability to create appropriate technical documentation.\n\n\nPhonePe Full Time Employee Benefits (Not applicable for Intern or Contract Roles)\n\n\nInsurance Benefits - Medical Insurance, Critical Illness Insurance, Accidental Insurance, Life Insurance\nWellness Program - Employee Assistance Program, Onsite Medical Center, Emergency Support System\nParental Support - Maternity Benefit, Paternity Benefit Program, Adoption Assistance Program, Day-care Support Program\nMobility Benefits - Relocation benefits, Transfer Support Policy, Travel Policy\nRetirement Benefits - Employee PF Contribution, Flexible PF Contribution, Gratuity, NPS, Leave Encashment\nOther Benefits - Higher Education Assistance, Car Lease, Salary Advance Policy\n\n\nOur inclusive culture promotes individual expression, creativity, innovation, and achievement and in turn helps us better understand and serve our customers. We see ourselves as a place for intellectual curiosity, ideas and debates, where diverse perspectives lead to deeper understanding and better quality results. PhonePe is an equal opportunity employer and is committed to treating all its employees and job applicants equally; regardless of gender, sexual preference, religion, race, color or disability. If you have a disability or special need that requires assistance or reasonable accommodation, during the application and hiring process, including support for the interview or onboarding process, please fill out this form.\n\nRead more about PhonePe on our blog.\n\nLife at PhonePe\n\nPhonePe in the news\nShow more "
  },
  {
    "job_id": "4106054438",
    "title": "Regulatory Data Engineer",
    "company": "Sphera",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/regulatory-data-engineer-at-sphera-4106054438?position=13&pageNum=0&refId=mM%2BrJCuQNTD1BFzX6JGUaQ%3D%3D&trackingId=HAgAR%2F1yUSP0UEui6TTXTg%3D%3D",
    "description": "Sphera is a leading global provider of enterprise software and services that enables companies to manage and optimize their environmental, health, safety and sustainability. Our mission is to create a safer, more sustainable and productive world.\n\nSphera is a portfolio company of Blackstone, a U.S.-based alternative asset investment company that focuses on private equity, technology and innovation, and more. Blackstone businesses succeed through strong partnerships, a personalized approach and a commitment to exceptional performance with uncompromising integrity. Sphera and Blackstone are leaders in the Environmental, Social and Governance (ESG) space.\n\nWe are guided by our core values of Customer Centricity, Accountability, Bias to Action, Innovation, and Collaboration. These values help us recruit the right talent to join our rapidly expanding team of around the globe. It is important to us that each and every Spherion is not only eager to challenge themselves and knows how to get work done but is an awesome addition to our company culture.\n\nThis position focuses on collecting data on chemical substances from published regulatory or industry association sources. Examples include international inventory lists, occupational exposure limits, GHS classification lists, environmental emission restrictions (air, water, waste), transport of dangerous goods, and physical properties among other types of data.\n\nRoles And Responsibilities\n\n\nProactively monitor legislation maintained by Sphera by reviewing regulatory standards and interpretations, registers, gazettes, newsletters, etc. as related to Regulatory Data Content.\nIdentify applicable new and updated/revised legislation and obtain official source documents.\nAnalyze regulations for inclusion in Regulatory Content database.\nDevelop and maintain technical documentation (in pre-defined templates) that clearly describes the analysis and interpretation of the Regulatory Data Lists.\nPerform assigned data maintenance projects for a repository of over 230,000 regulated chemical substances. Be fully accountable for the individual update assignments in terms of quality and schedule.\nDevelop and maintain effective relationships with regulatory agency contacts and consultants specializing in specific regulations.\nLiaise with Content Development, Rules, QA, product management and other teams to identify and implement continuous improvement initiatives for content quality and work process efficiency enhancements.\nAttend weekly meetings with the Regulatory Data Analysts/Data team.\n\n\nRequired Education\n\n\nUniversity degree in Chemistry, Toxicology, Ecology or related fields. University or Advanced degree or professional certification in a related field is considered an asset.\n\n\nPreferred Experience\n\n\n0-2 years of experience working with EHS regulations or practical experience working with chemicals.\nExperience working with relational databases using programs such as MS Access or SQL.\nExperience with data manipulation in MS Excel.\nExperience with other MS office programs.\nGood knowledge of chemical nomenclature and chemical structures.\nFluent in English (both spoken and written) and strong reading/writing skills.\nPreferable knowledge of any other languages (i.e. French, German, Spanish or a language from Eastern Asia).\n\n\nOther Skills\n\n\nKnowledge of global chemical regulations and GHS; experience authoring Safety Data Sheets will be an advantage.\nAbility to assign chemical substances to applicable chemical groups based on properties such as solubility, metal content, petroleum streams, etc. will be an advantage.\nHigh level of attention to detail.\nHigh level of initiative.\nFlexible, adaptable to change.\nExcellent organizational, time-management and prioritization skills.\nExcellent interpersonal and communication skills.\n\n\nPhysical Requirements: Ability to physically perform general office requirements. Must be able to perform essential responsibilities with or without reasonable accommodations.\n\nSphera is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.\n\nThis job description is intended to convey information essential to understanding the scope of the job and the general nature and level of work performed by job holders within this job. This job description is not intended to be an exhaustive list of qualifications, skills, efforts, duties, responsibilities or working conditions associated with the position.\nShow more "
  },
  {
    "job_id": "4270387667",
    "title": "Data Analyst",
    "company": "myGwork - LGBTQ+ Business Community",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/data-analyst-at-mygwork-lgbtq%2B-business-community-4270387667?position=14&pageNum=0&refId=mM%2BrJCuQNTD1BFzX6JGUaQ%3D%3D&trackingId=dHgr9LgSLjF1iRH6MY747g%3D%3D",
    "description": "This job is with Moody's, an inclusive employer and a member of myGwork – the largest global platform for the LGBTQ+ business community. Please do not contact the recruiter directly.\n\nAt Moody's, we unite the brightest minds to turn today’s risks into tomorrow’s opportunities. We do this by striving to create an inclusive environment where everyone feels welcome to be who they are—with the freedom to exchange ideas, think innovatively, and listen to each other and customers in meaningful ways.\n\nIf you are excited about this opportunity but do not meet every single requirement, please apply! You still may be a great fit for this role or other open roles. We are seeking candidates who model our values: invest in every relationship, lead with curiosity, champion diverse perspectives, turn inputs into actions, and uphold trust through integrity.\n\nJob Description\n\nJob Title - Data Analyst\n\nEntity - Moody’s Analytics - India\n\nLine of Business/Department - Customer, Operations & Risk (COR) – Business Systems\n\nLocation - India - Remote\n\nFull Time\n\nReporting to – Director of Data Analytics\n\nSkills and Competencies\n\n\nDemonstrated proficiency with SQL scripting/debugging, integration tools, and cloud warehouses - Required\nAbility to communicate complex concepts clearly and collaborate effectively with stakeholders - Required\nAbility to condense information into clear/tangible insights and story-tell with data - Required\nProven ability to work independently and as part of a distributed team, taking direction from multiple team members - Required\nKnowledgeable in data modelling techniques - Required\nExperience in reporting-based software, such as Tableau, PowerBI, and Qlik - Preferred\n\n\nEducation\n\n\nBS/BA/Advanced degree in Engineering, Computer Science, Business Analytics, Data Science or a related field\n\n\nResponsibilities\n\nThis role will be a key contributor to our technology, infrastructure, and operations from automating manual operational tasks, creating robust data transformation workflows, to supporting self-service analysis.\n\n\nModel raw data into clean, tested, and reusable datasets.\nTransform data by removing, flagging, or filtering inaccurate, sensitive, or corrupted records; aggregating data items; and joining database tables.\nEstablish data quality rules, requirements, and metrics to ensure accuracy and consistency.\nBuild and maintain dashboards and visualizations, including:\nIndividual analytics reports\nOperational dashboards\nStrategic dashboards (e.g., tracking KPIs or OKRs)\nAnalytical dashboards (e.g., identifying trends)\nForecasting tools\nDrive best practices for data handling, quality control, and change management across production reports and dashboards.\nDocument data practices to promote a shared language and consistent definitions among analysts.\nCreate reusable data assets that are ready for analysis.\nPartner with internal teams (e.g., Financial Planning & Analytics, Customer Success, Sales Performance & Analytics) to ensure high-quality user experiences and adoption of new reporting methods.\nLead automation and modernization initiatives for reporting structures and data visualizations.\nIdentify and implement process and workflow improvements using Generative/Agentic AI and other approved technologies.\nUnderstand business requirements and deliver clear, actionable insights that support customer-centric decision-making.\nCollaborate with internal stakeholders to standardize and enhance existing processes, improving operational efficiency and performance.\n\n\nAbout The Team\n\nThe Customer, Operations & Risk (COR) team at Moody’s is a dynamic, cross-functional group that supports enterprise-wide systems, customer engagement, and risk management. COR encompasses several specialized functions including Customer Engagement, Business Systems, Business Integration & Operations, Risk, Sales Performance Management, and Learning & Development. The team plays a critical role in integrating acquisitions, modernizing operational platforms, and ensuring data quality and regulatory compliance across the organization. COR partners closely with business units to streamline the lead-to-cash lifecycle, enhance customer experience, and mitigate operational and data risks. This team is ideal for professionals who thrive in a collaborative, fast-paced environment and are passionate about driving operational excellence and strategic impact.\n\nMoody’s is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, sexual orientation, gender expression, gender identity or any other characteristic protected by law.\n\nCandidates for Moody's Corporation may be asked to disclose securities holdings pursuant to Moody’s Policy for Securities Trading and the requirements of the position. Employment is contingent upon compliance with the Policy, including remediation of positions in those holdings as necessary.\nShow more "
  },
  {
    "job_id": "4247916630",
    "title": "Software Engineer - Growth Engineering",
    "company": "Cloudflare",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/software-engineer-growth-engineering-at-cloudflare-4247916630?position=17&pageNum=0&refId=mM%2BrJCuQNTD1BFzX6JGUaQ%3D%3D&trackingId=OxRxGXXk9pt3JVLGl2vrBg%3D%3D",
    "description": "About Us\n\nAt Cloudflare, we are on a mission to help build a better Internet. Today the company runs one of the world’s largest networks that powers millions of websites and other Internet properties for customers ranging from individual bloggers to SMBs to Fortune 500 companies. Cloudflare protects and accelerates any Internet application online without adding hardware, installing software, or changing a line of code. Internet properties powered by Cloudflare all have web traffic routed through its intelligent global network, which gets smarter with every request. As a result, they see significant improvement in performance and a decrease in spam and other attacks. Cloudflare was named to Entrepreneur Magazine’s Top Company Cultures list and ranked among the World’s Most Innovative Companies by Fast Company.\n\nWe realize people do not fit into neat boxes. We are looking for curious and empathetic individuals who are committed to developing themselves and learning new skills, and we are ready to help you do that. We cannot complete our mission without building a diverse and inclusive team. We hire the best people based on an evaluation of their potential and support them throughout their time at Cloudflare. Come join us!\n\nAvailable Locations: Bengaluru\n\nAbout The Department\n\nThe Growth Engineering team is responsible for building world-class experiences that help the millions of Cloudflare self-service customers get what they need faster, from acquisition and onboarding all the way through to adoption and scale up. Our team is focused on high velocity experimentation and thoughtful optimizations to that experience on Cloudflare’s properties.\n\nThis team has a dual mandate, also focusing on evolving our current marketing attribution, customer event ingress and experimentation capabilities that process billions of events across those properties to drive data-driven decision making.\n\nAs an engineer for the team responsible for Data Capture and Experimentation, your job will be to deliver on those growth-driven features and experiences while evolving our current marketing attribution, consumer event ingress and experimentation setup across these experiences, and partner with many teams on implementations.\n\nAbout The Role\n\nWe are looking for experienced full-stack engineers to join the Experimentation and Data Capture team. The ideal candidate will have experience working with large-scale applications, familiarity with event-driven data capture, and strong understanding of system design. You must care deeply not only about the quality of your and the team's code, but also the customer experience and developer experience. We have a great opportunity to evolve our current data capture and experimentation systems to better serve our customers.\n\nWe are also strong believers in dog-fooding our own products. From cache configuration to Cloudflare Access, Cloudflare Workers, and Zaraz, these are all tools in our engineer's tool belt, so it is a plus if you have been a customer of ours, even as a free user.\n\nWhat You’ll Do\n\nThe Experimentation and Data Capture Engineering Team will be responsible for the following:\n\n\nTechnical delivery for Experimentation and Data Capture capabilities intended for all of our customer-facing UI properties, driving user acquisition, engagement, and retention through data-driven strategies and technical implementations\nCollaborate with product, design and stakeholders to establish outcome measurements, roadmaps and key deliverables\nOwn and lead execution of engineering projects in the area of web data acquisition and experimentation\nWork across the entire product lifecycle from conceptualization through production\nBuild features end-to-end: front-end, back-end, IaC, system design, debugging and testing, engaging with feature teams and data processing teams\nInspire and mentor less experienced engineers\nWork closely with the trust and safety team to handle any compliance or data privacy-related matters\n\n\n\nExamples Of Desirable Skills, Knowledge And Experience\n\n\nComfort with building reusable SDKs and UI components with TypeScript/JavaScript required, comfort/familiarity with other languages (Go/Rust/Python) a plus.\nExperience building with high-scale serverless systems like Cloudflare Workers, AWS Lambda, Azure Functions, etc.\nDesign and execute A/B tests and experiments to optimize for business KPIs, including user onboarding, feature adoption, and overall product experience. Create reusable components for other developers to leverage.\nExperience with publishing-to and querying-from data lake/warehouse products like Clickhouse, Apache Iceberg, to evaluate experiments. Familiarity with commercial analytics systems (Adobe Analytics, Google BigQuery, etc) a plus.\nImplement tracking and attribution systems to understand user behavior and measure the effectiveness of growth initiatives.\nFamiliarity with event driven architectures, high-scale data processing, issues that can occur and how to protect against them.\nFamiliarity with global data privacy requirements governed by laws like GDPR/CCPA/etc, and the implications for data capture, modeling, and analysis.\nDesire to work in a very fast-paced environment.\n\n\n\nWhat Makes Cloudflare Special?\n\nWe’re not just a highly ambitious, large-scale technology company. We’re a highly ambitious, large-scale technology company with a soul. Fundamental to our mission to help build a better Internet is protecting the free and open Internet.\n\nProject Galileo: Since 2014, we've equipped more than 2,400 journalism and civil society organizations in 111 countries with powerful tools to defend themselves against attacks that would otherwise censor their work, technology already used by Cloudflare’s enterprise customers--at no cost.\n\nAthenian Project: In 2017, we created the Athenian Project to ensure that state and local governments have the highest level of protection and reliability for free, so that their constituents have access to election information and voter registration. Since the project, we've provided services to more than 425 local government election websites in 33 states.\n\n1.1.1.1: We released 1.1.1.1 to help fix the foundation of the Internet by building a faster, more secure and privacy-centric public DNS resolver. This is available publicly for everyone to use - it is the first consumer-focused service Cloudflare has ever released. Here’s the deal - we don’t store client IP addresses never, ever. We will continue to abide by our privacy commitment and ensure that no user data is sold to advertisers or used to target consumers.\n\nSound like something you’d like to be a part of? We’d love to hear from you!\n\nThis position may require access to information protected under U.S. export control laws, including the U.S. Export Administration Regulations. Please note that any offer of employment may be conditioned on your authorization to receive software or technology controlled under these U.S. export laws without sponsorship for an export license.\n\nCloudflare is proud to be an equal opportunity employer. We are committed to providing equal employment opportunity for all people and place great value in both diversity and inclusiveness. All qualified applicants will be considered for employment without regard to their, or any other person's, perceived or actual race, color, religion, sex, gender, gender identity, gender expression, sexual orientation, national origin, ancestry, citizenship, age, physical or mental disability, medical condition, family care status, or any other basis protected by law. We are an AA/Veterans/Disabled Employer.\n\nCloudflare provides reasonable accommodations to qualified individuals with disabilities. Please tell us if you require a reasonable accommodation to apply for a job. Examples of reasonable accommodations include, but are not limited to, changing the application process, providing documents in an alternate format, using a sign language interpreter, or using specialized equipment. If you require a reasonable accommodation to apply for a job, please contact us via e-mail at hr@cloudflare.com or via mail at 101 Townsend St. San Francisco, CA 94107.\nShow more "
  },
  {
    "job_id": "4250267754",
    "title": "Machine Learning Engineer",
    "company": "AB InBev GCC India",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/machine-learning-engineer-at-ab-inbev-gcc-india-4250267754?position=18&pageNum=0&refId=mM%2BrJCuQNTD1BFzX6JGUaQ%3D%3D&trackingId=bzOMBSHGnBGWR255SRzK6Q%3D%3D",
    "description": "Dreaming big is in our DNA. It’s who we are as a company. It’s our culture. It’s our heritage. And more than ever, it’s our future. A future where we’re always looking forward. Always serving up new ways to meet life’s moments. A future where we keep dreaming bigger. We look for people with passion, talent, and curiosity, and provide them with the teammates, resources and opportunities to unleash their full potential. The power we create together – when we combine your strengths with ours – is unstoppable. Are you ready to join a team that dreams as big as you do?\n\nAB InBev GCC was incorporated in 2014 as a strategic partner for Anheuser-Busch InBev. The center leverages the power of data and analytics to drive growth for critical business functions such as operations, finance, people, and technology. The teams are transforming Operations through Tech and Analytics.\n\nDo You Dream Big?\n\nWe Need You.\n\nJob Description\n\nJob Title: Junior Data Scientist\n\nLocation: Bangalore\n\nReporting to: Senior Manager – Analytics\n\n\nPurpose of the role\n\nThe Global GenAI Team at Anheuser-Busch InBev (AB InBev) is tasked with constructing competitive solutions utilizing GenAI techniques. These solutions aim to extract contextual insights and meaningful information from our enterprise data assets. The derived data-driven insights play a pivotal role in empowering our business users to make well-informed decisions regarding their respective products. In the role of a Machine Learning Engineer (MLE), you will operate at the intersection of:\n\n\nLLM-based frameworks, tools, and technologies\nCloud-native technologies and solutions\nMicroservices-based software architecture and design patterns As an additional responsibility, you will be involved in the complete development cycle of new product features, encompassing tasks such as the development and deployment of new models integrated into production systems. Furthermore, you will have the opportunity to critically assess and influence the product engineering, design, architecture, and technology stack across multiple products, extending beyond your immediate focus.\nKey tasks & accountabilities\n\nLarge Language Models (LLM):\n\n\nExperience with LangChain, LangGraph\nProficiency in building agentic patterns like ReAct, ReWoo, LLMCompiler\n\nMulti-modal Retrieval-Augmented Generation (RAG):\n\n\nExpertise in multi-modal AI systems (text, images, audio, video)\nDesigning and optimizing chunking strategies and clustering for large data processing\n\nStreaming & Real-time Processing:\n\n\nExperience in audio/video streaming and real-time data pipelines\nLow-latency inference and deployment architectures\n\nNL2SQL:\n\n\nNatural language-driven SQL generation for databases\nExperience with natural language interfaces to databases and query optimization\n\nAPI Development:\n\n\nBuilding scalable APIs with FastAPI for AI model serving\n\nContainerization & Orchestration:\n\n\nProficient with Docker for containerized AI services\nExperience with orchestration tools for deploying and managing services\n\nData Processing & Pipelines:\n\n\nExperience with chunking strategies for efficient document processing\nBuilding data pipelines to handle large-scale data for AI model training and inference\n\nAI Frameworks & Tools:\n\n\nExperience with AI/ML frameworks like TensorFlow, PyTorch\nProficiency in LangChain, LangGraph, and other LLM-related technologies\n\nPrompt Engineering:\n\n\nExpertise in advanced prompting techniques like Chain of Thought (CoT) prompting, LLM Judge, and self-reflection prompting\nExperience with prompt compression and optimization using tools like LLMLingua, AdaFlow, TextGrad, and DSPy\nStrong understanding of context window management and optimizing prompts for performance and efficiency\n3. Qualifications, Experience, Skills\n\n\nLevel of educational attainment required (1 or more of the following)\n\n\nBachelor's or masterʼs degree in Computer Science, Engineering, or a related field.\n\nPrevious Work Experience Required\n\n\nProven experience of 3+ years in developing and deploying applications utilizing Azure OpenAI and Redis as a vector database.\n\nTechnical Skills Required\n\n\nSolid understanding of language model technologies, including LangChain, OpenAI Python SDK, LammaIndex, OLamma, etc.\nProficiency in implementing and optimizing machine learning models for natural language processing.\nExperience with observability tools such as mlflow, langsmith, langfuse, weight and bias, etc.\nStrong programming skills in languages such as Python and proficiency in relevant frameworks.\nFamiliarity with containerization and orchestration tools (e.g., Docker, Kubernetes).\n\nAnd above all of this, an undying love for beer!\n\nWe dream big to create future with more cheer\nShow more "
  },
  {
    "job_id": "4272721430",
    "title": "Lead Software Engineer",
    "company": "Mphasis",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/lead-software-engineer-at-mphasis-4272721430?position=22&pageNum=0&refId=mM%2BrJCuQNTD1BFzX6JGUaQ%3D%3D&trackingId=giUrr22X2qWtcNKkRHatvw%3D%3D",
    "description": "Job Summary:\n\nWe are seeking a skilled OpenText xPression Developer to design, develop, and maintain document templates and customer communications using the xPression platform. The ideal candidate will collaborate with business and technical teams to deliver high-quality, personalized communications across multiple channels.\n\n\n\n\nKey Responsibilities:\n\nDesign and develop document templates using OpenText xPression.\nIntegrate xPression with enterprise systems for automated document generation.\nCollaborate with stakeholders to gather requirements and translate them into technical solutions.\nPerform testing, debugging, and optimization of templates and workflows.\nMaintain documentation and version control of templates and configurations.\nSupport production deployments and troubleshoot Xpression as needed.\n\n\n\n\nRequired Skills & Qualifications:\n\nBachelor’s degree in computer science, Engineering, or a related field.\n6+ years of experience with OpenText xPression or similar CCM platforms.\nProficiency in XML, XSLT, and related technologies.\nExperience with document composition, automation, and output management.\nStrong problem-solving and communication skills.\n\nPreferred Skills:\n\nExperience with OpenText Exstream, StreamServe, or similar tools.\nFamiliarity with Agile development methodologies.\nKnowledge of customer experience and digital transformation strategies.\nShow more "
  },
  {
    "job_id": "4262499697",
    "title": "Sr. Software Engineer , DRM",
    "company": "Netskope",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/sr-software-engineer-drm-at-netskope-4262499697?position=23&pageNum=0&refId=mM%2BrJCuQNTD1BFzX6JGUaQ%3D%3D&trackingId=f%2FkwaJwzbL9L9jFH%2F5lgKg%3D%3D",
    "description": "About Netskope\n\nToday, there's more data and users outside the enterprise than inside, causing the network perimeter as we know it to dissolve. We realized a new perimeter was needed, one that is built in the cloud and follows and protects data wherever it goes, so we started Netskope to redefine Cloud, Network and Data Security.\n\nSince 2012, we have built the market-leading cloud security company and an award-winning culture powered by hundreds of employees spread across offices in Santa Clara, St. Louis, Bangalore, London, Paris, Melbourne, Taipei, and Tokyo. Our core values are openness, honesty, and transparency, and we purposely developed our open desk layouts and large meeting spaces to support and promote partnerships, collaboration, and teamwork. From catered lunches and office celebrations to employee recognition events and social professional groups such as the Awesome Women of Netskope (AWON), we strive to keep work fun, supportive and interactive. Visit us at Netskope Careers. Please follow us on LinkedIn and Twitter@Netskope.\n\nAbout the Role:\n\nNetskope Digital Rights Management (DRM) product line is a broad set of solutions that controls access and protection to digital content. This helps the security administrator with content classification, access control, content encryption, etc., ensuring enhanced Data Loss Prevention. These solutions empower security administrators with robust tools for content classification, granular access control, and advanced content encryption. By integrating these capabilities, Netskope DRM significantly enhances an organization's overall Data Loss Prevention (DLP) posture, ensuring sensitive information remains secure and compliant with regulatory requirements.\n\nWhat’s In It For You:\n\n\nImpactful Work: Contribute to a critical security product line that directly protects sensitive enterprise data.\nInnovation: Work on cutting-edge technologies in digital rights management, encryption, and data lineage.\nCareer Growth: Opportunities for technical leadership and mentorship within a rapidly growing security company.\nCollaborative Environment: Join a talented team of engineers passionate about solving complex security challenges.\n\n\nWhat You Will Do:\n\n\nDesign, develop, and maintain high-performance, scalable, and secure software for the Netskope DRM product line.\nLead the architecture and implementation of new features, enhancements, and integrations for DRM solutions.\nDrive technical excellence, including code reviews, best practices, and adherence to security standards.\nCollaborate cross-functionally with product management, QA, and other engineering teams to define requirements and deliver solutions.\nMentor junior engineers and contribute to their professional development.\nTroubleshoot and resolve complex technical issues related to DRM functionality and performance.\nStay up-to-date with industry trends and emerging technologies in digital rights management and data security.\n\n\nWhat You Bring:\n\n\n4+ years of experience in software development, with a significant focus on security products or related fields.\nStrong proficiency in one or more programming languages such as C++, or Go.\nDeep understanding of digital rights management (DRM) concepts, encryption algorithms, and access control mechanisms.\nExperience with data loss prevention (DLP) technologies and concepts.\nDemonstrated experience in designing and building scalable, distributed systems.\nFamiliarity with cloud platforms (AWS, GCP) and containerization technologies (Docker, Kubernetes).\nStrong problem-solving skills and the ability to work independently and as part of a team.\nExcellent communication and interpersonal skills.\nWorking knowledge of git or other version controlling tools.\nBachelor's or Master's degree in Computer Science, Engineering, or a related field.\n\n\nNetskope is committed to implementing equal employment opportunities for all employees and applicants for employment. Netskope does not discriminate in employment opportunities or practices based on religion, race, color, sex, marital or veteran statues, age, national origin, ancestry, physical or mental disability, medical condition, sexual orientation, gender identity/expression, genetic information, pregnancy (including childbirth, lactation and related medical conditions), or any other characteristic protected by the laws or regulations of any jurisdiction in which we operate.\n\nNetskope respects your privacy and is committed to protecting the personal information you share with us, please refer to Netskope's Privacy Policy for more details.\n\n\nShow more "
  },
  {
    "job_id": "4272713994",
    "title": "Data Scientist",
    "company": "Arctan",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-arctan-4272713994?position=26&pageNum=0&refId=mM%2BrJCuQNTD1BFzX6JGUaQ%3D%3D&trackingId=tIOwsKLVt5jNXYFSJfLJag%3D%3D",
    "description": "About Arctan\n\nAt Arctan, we’re solving a hard problem that matters: Eliminating communication barriers in Global conversations. Our AI product refines speech on the fly, adjusting accents and tonality, helping Customer Facing teams engage better with their customers and build rapport effortlessly across cultures.\n\n\n\n\nRole Overview\n\nAs a Data Scientist, you will play a key role in improving and optimising the models that drive Arctan’s real-time speech AI. You’ll work on analysing, processing, and modelling data to make our systems smarter.\n\nSpecifically, you’ll:\n\nDevelop and fine-tune Speech to Speech machine learning models\nExperiment with data-driven solutions to enhance AI performance.\nWork on feature engineering and dataset preparation to train robust models.\nCollaborate with the team to evaluate and deploy models into production.\n\n\n\n\nWhat we’re looking for:\n\nStrong problem-solving skills, paired with a passion for learning.\n1-3 years of experience in Data Science and related fields.\nExperience with speech processing or NLP.\nProficiency in Python and familiarity with data science libraries.\nUnderstanding of machine learning frameworks (e.g., TensorFlow, PyTorch).\nFamiliarity with working on datasets and data preprocessing techniques.\n\n\n\n\nBenefits And Perks:\n\nYou’ll be joining an early stage startup building foundational Speech models\nBeing a part of a small, high talent density team would accelerate your career growth\nYou'll wear multiple hats, own meaningful projects, and build things that ship.\nShow more "
  },
  {
    "job_id": "4247796936",
    "title": "Data & Analytics Strategy Executive",
    "company": "dentsu",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/data-analytics-strategy-executive-at-dentsu-4247796936?position=27&pageNum=0&refId=mM%2BrJCuQNTD1BFzX6JGUaQ%3D%3D&trackingId=YlMxjiTDE%2BbweNeCImI7sg%3D%3D",
    "description": "The purpose of this role is data analysis/guided deliverable development in support of assessment/strategic deliverables.\n\nJob Description:\n\nKey responsibilities:\n\nAggregates data, prepares and analyses as it relates to assessment and roadmap development and execution\n\nProduces detailed analysis that facilitates internal team discussion and client facing deliverables\n\nUses, evaluates and improves internal templates, tools and processes\n\nExecutes and progresses project timeline\n\nSkills: Tableau, SQL, EXCEL, Media Domain Knowledge, Python(good to have).\n\nLocation:\n\nMumbai\n\nBrand:\n\nMerkle\n\nTime Type:\n\nFull time\n\nContract Type:\n\nPermanent\nShow more "
  },
  {
    "job_id": "4270831933",
    "title": "Software Dev Engineer-Embedded Systems, Consumer Robotics",
    "company": "myGwork - LGBTQ+ Business Community",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/software-dev-engineer-embedded-systems-consumer-robotics-at-mygwork-lgbtq%2B-business-community-4270831933?position=31&pageNum=0&refId=mM%2BrJCuQNTD1BFzX6JGUaQ%3D%3D&trackingId=FmGbdTNaT0JretNQQ8yr%2Fw%3D%3D",
    "description": "This job is with Amazon, an inclusive employer and a member of myGwork – the largest global platform for the LGBTQ+ business community. Please do not contact the recruiter directly.\n\nDescription\n\nAt Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. The focus we have on our customers is why we are one of the world's most beloved brands - customer obsession is part of our company DNA. Our Software Development Engineers (SDEs) use cutting-edge technology to solve complex problems and get to see the impact of their work first-hand. The challenges SDEs solve for at Amazon are big and influence millions of customers, sellers, and products around the world. We are looking for individuals who are passionate about creating new products, features, and services from scratch while managing ambiguity and the pace of a company where development cycles are measured in weeks, not years. If this sounds interesting to you, apply and come chart your own path at Amazon.\n\nApplications are reviewed on a rolling basis. For an update on your status, or to confirm your application was submitted successfully, please login to your candidate portal. NOTE: Amazon works with a high volume of applicants, so we appreciate your patience as we review applications\n\nKey job responsibilities\n\n\nCollaborate with experienced cross-disciplinary Amazonians to conceive, design, and bring innovative products and services to market.\nDesign and build innovative technologies in a large distributed computing environment and help lead fundamental changes in the industry.\nCreate solutions to run predictions on distributed systems with exposure to innovative technologies at incredible scale and speed.\nBuild distributed storage, index, and query systems that are scalable, fault-tolerant, low cost, and easy to manage/use.\nDesign and code the right solutions starting with broadly defined problems.\nWork in an agile environment to deliver high-quality software.\n\n\nBasic Qualifications\n\n\nBachelor's degree or equivalent\n\n\nPreferred Qualifications\n\n\nAre enrolled in or have completed a Bachelor's degree within last 12 months in engineering or equivalent\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you're applying in isn't listed, please contact your Recruiting Partner.\nShow more "
  },
  {
    "job_id": "4275809118",
    "title": "Consultant I (Survey)",
    "company": "Aon",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/consultant-i-survey-at-aon-4275809118?position=32&pageNum=0&refId=mM%2BrJCuQNTD1BFzX6JGUaQ%3D%3D&trackingId=dFJk5a3%2B3C4jcAytnHWxng%3D%3D",
    "description": "IND Consultant II GSMS - Global Survey Team\n\nConsultant I will be responsible for Actively advise clients by designing & executing analysis, interpreting results and generating key insights and work with Aon’s revenue data. Build and conduct surveys for the globe for different countries; involves communicating with stake holders/clients through mail & phone, understanding their requirement and provide solutions and data analysis\n\nAon is in the business of better decisions\n\nAt Aon, we shape decisions for the better to protect and enrich the lives of people around the world.\n\nAs an organization, we are united through trust as one inclusive team and we are passionate about helping our colleagues and clients succeed.\n\nWork Description/Role Summary\n\n\nActively advise clients by designing & executing analysis, interpreting results and generating key insights\nClient Satisfaction Surveys- deployment, management and data analysis.\nExplain the findings to our clients and stakeholders over a video/voice call.\nDelivering well organized reports, dashboards, data analysis and statistical models\nUnderstanding business requirements and coordinating with business unit leaders, particularly marketing liaisons for reports/ data.\nActively gathers and shares domain related knowledge in forums within the organization.\nCurating the content-based projects and timely completion of the project\nArticulate and write highly complex editorial summaries for specific events\nResponsible for investigating, writing, structuring, and updating documentation and articles.\n\n\nRole Overview\n\nConsultant I will be responsible for Actively advise clients by designing & executing analysis, interpreting results and generating key insights and work with Aon’s revenue data. Build and conduct surveys for the globe for different countries; involves communicating with stake holders/clients through mail & phone, understanding their requirement and provide solutions and data analysis\n\nMandatory Skills\n\n\nSurvey analytics, hands on experience in survey tools like Survey monkey, Survey Gizmo(Alchemer), Qualtrics or Medallia etc.\nExcel, VB and Power Point\n\n\nExpertise in Power BI\n\nHow we support our colleagues\n\nIn addition to our comprehensive benefits package, we encourage an inclusive workforce. Plus, our agile environment allows you to manage your wellbeing and work/life balance, ensuring you can be your best self at Aon. Furthermore, all colleagues enjoy two “Global Wellbeing Days” each year, encouraging you to take time to focus on yourself. We offer a variety of working style solutions for our colleagues as well.\n\nOur continuous learning culture inspires and equips you to learn, share and grow, helping you achieve your fullest potential. As a result, at Aon, you are more connected, more relevant, and more valued.\n\nAon values an innovative and inclusive workplace where all colleagues feel empowered to be their authentic selves. Aon is proud to be an equal opportunity workplace.\n\nAon provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, creed, sex, sexual orientation, gender identity, national origin, age, disability, veteran, marital, domestic partner status, or other legally protected status.\n\nWe are committed to providing equal employment opportunities and fostering an inclusive workplace. If you require accommodations during the application or interview process, please let us know. You can request accommodations by emailing us at ReasonableAccommodations@Aon.com or your recruiter. We will work with you to meet your needs and ensure a fair and equitable experience.\n\n2562278\n\n\nShow more "
  },
  {
    "job_id": "4143201595",
    "title": "Software Engineer (5-8yrs)",
    "company": "PhonePe",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/software-engineer-5-8yrs-at-phonepe-4143201595?position=2&pageNum=0&refId=%2FpFiA5tX16IeK6cKkJTqxw%3D%3D&trackingId=4Rn2z1i6d0k0%2BOfAOCeuhA%3D%3D",
    "description": "About PhonePe Limited:\n\nHeadquartered in India, its flagship product, the PhonePe digital payments app, was launched in Aug 2016. As of April 2025, PhonePe has over 60 Crore (600 Million) registered users and a digital payments acceptance network spread across over 4 Crore (40+ million) merchants. PhonePe also processes over 33 Crore (330+ Million) transactions daily with an Annualized Total Payment Value (TPV) of over INR 150 lakh crore.\n\nPhonePe’s portfolio of businesses includes the distribution of financial products (Insurance, Lending, and Wealth) as well as new consumer tech businesses (Pincode - hyperlocal e-commerce and Indus AppStore Localized App Store for the Android ecosystem) in India, which are aligned with the company’s vision to offer every Indian an equal opportunity to accelerate their progress by unlocking the flow of money and access to services.\n\nCulture:\n\nAt PhonePe, we go the extra mile to make sure you can bring your best self to work, Everyday!. And that starts with creating the right environment for you. We empower people and trust them to do the right thing. Here, you own your work from start to finish, right from day one. PhonePe-rs solve complex problems and execute quickly; often building frameworks from scratch. If you’re excited by the idea of building platforms that touch millions, ideating with some of the best minds in the country and executing on your dreams with purpose and speed, join us!\n\nChallenges\n\nBuilding for Scale, Rapid Iterative Development, and Customer-centric Product Thinking at each step defines every day for a developer at PhonePe. Though we engineer for a 50million+ strong user base, we code with every individual user in mind. While we are quick to adopt the latest in Engineering, we care utmost for security, stability, and automation. Apply if you want to experience the best combination of passionate application development and product-driven thinking\n\nAs a Software Engineer:\n\n\nYou will build Robust and scalable web-based applications You will need to think of platforms & reuse\nBuild abstractions and contracts with separation of concerns for a larger scope\nDrive problem-solving skills for high-level business and technical problems.\nDo high-level design with guidance; Functional modeling, break-down of a module\nDo incremental changes to architecture: impact analysis of the same\nDo performance tuning and improvements in large scale distributed systems\nMentor young minds and foster team spirit, break down execution into phases to bring predictability to overall execution\nWork closely with Product Manager to derive capability view from features/solutions, Lead execution of medium-sized projects\nWork with broader stakeholders to track the impact of projects/features and proactively iterate to improve them As a senior software engineer you must have\nExtensive and expert programming experience in at least one general programming language (e.g. Java, C, C++) & tech stack to write maintainable, scalable, unit-tested code.\nExperience with multi-threading and concurrency programming\nExtensive experience in object-oriented design skills, knowledge of design patterns, and huge passion and ability to design intuitive module and class-level interfaces\nExcellent coding skills – should be able to convert the design into code fluently\nKnowledge of Test Driven Development\nGood understanding of databases (e.g. MySQL) and NoSQL (e.g. HBase, Elasticsearch, Aerospike, etc)\nStrong desire to solving complex and interesting real-world problems\nExperience with full life cycle development in any programming language on a Linux platform\nGo-getter attitude that reflects in energy and intent behind assigned tasks\nWorked in a startups environment with high levels of ownership and commitment\nBTech, MTech, or Ph.D. in Computer Science or related technical discipline (or equivalent).\nExperience in building highly scalable business applications, which involve implementing large complex business flows and dealing with a huge amount of data.\n9+ years of experience in the art of writing code and solving problems on a Large Scale.\nAn open communicator who shares thoughts and opinions frequently listens intently and takes constructive feedback.\n\n\nAs a Software Engineer, good to have\n\n\nThe ability to drive the design and architecture of multiple subsystems\nAbility to break-down larger/fuzzier problems into smaller ones in the scope of the product\nUnderstanding of the industry’s coding standards and an ability to create appropriate technical documentation.\n\n\nPhonePe Full Time Employee Benefits (Not applicable for Intern or Contract Roles)\n\n\nInsurance Benefits - Medical Insurance, Critical Illness Insurance, Accidental Insurance, Life Insurance\nWellness Program - Employee Assistance Program, Onsite Medical Center, Emergency Support System\nParental Support - Maternity Benefit, Paternity Benefit Program, Adoption Assistance Program, Day-care Support Program\nMobility Benefits - Relocation benefits, Transfer Support Policy, Travel Policy\nRetirement Benefits - Employee PF Contribution, Flexible PF Contribution, Gratuity, NPS, Leave Encashment\nOther Benefits - Higher Education Assistance, Car Lease, Salary Advance Policy\n\n\nOur inclusive culture promotes individual expression, creativity, innovation, and achievement and in turn helps us better understand and serve our customers. We see ourselves as a place for intellectual curiosity, ideas and debates, where diverse perspectives lead to deeper understanding and better quality results. PhonePe is an equal opportunity employer and is committed to treating all its employees and job applicants equally; regardless of gender, sexual preference, religion, race, color or disability. If you have a disability or special need that requires assistance or reasonable accommodation, during the application and hiring process, including support for the interview or onboarding process, please fill out this form.\n\nRead more about PhonePe on our blog.\n\nLife at PhonePe\n\nPhonePe in the news\nShow more "
  },
  {
    "job_id": "4276022760",
    "title": "Analyst, Data Entry",
    "company": "Sattva Knowledge Institute",
    "location": "Bengaluru, Karnataka, India",
    "date": "2025-07-26",
    "link": "https://in.linkedin.com/jobs/view/analyst-data-entry-at-sattva-knowledge-institute-4276022760?position=5&pageNum=0&refId=%2FpFiA5tX16IeK6cKkJTqxw%3D%3D&trackingId=LWvQMkRoySnY27W8vdRDJw%3D%3D",
    "description": "Position: Analyst\n\nLocation: Bengaluru\n\nTenure: Contract\n\nAbout Sattva\n\nWe Partner to deliver social impact at scale\n\nSattva Consulting is a global impact consulting firm from India. Since 2009 we have been engaging with communities, business and government to achieve societal impact at scale.\n\nWe believe that Civil society, Business and Government all have a critical role to play in building an equitable and sustainable world, and we actively partner with all stakeholders to enable impact through our advisory & orchestration services, knowledge and data platforms which we have built as public goods for the ecosystem and collaborative solutions and partnerships.\n\nOur teams are based in India, Singapore, Denmark and UK, but as a global organization our work has spanned 25 countries and 5 continents. For more information, please visit: www.sattva.co.in\n\nThe opportunity\n\nBusiness Finance Specialist will be an integral member for the Business Finance team at Sattva, focused on performing several process management duties at BU and Sub-BU levels. The ideal candidate is highly self-motivated, professional, and capable of managing their workload and prioritising tasks in a fast-paced environment. This is an excellent opportunity to join a growing company and grow along with it.\n\nWho We Are Looking For\n\n\nBachelor’s and/or master’s degree\nStrong analytical and problem-solving skills; keen attention to details\nStrong experience in data analysis/insights and report generation and proficiency in MS Excel\nPositive and collaborative mindset; ability to work in teams\nAbility to work under pressure and manage expectations effectively\nSound judgment and strong integrity in dealing with people\nStrong communication skills\nAbility to navigate ambiguous situations\nPrior consulting experience is preferred in order to ensure a deep understanding of our target audience’s needs and skills in their roles\n\n\nWhat You’ll Do\n\nThis is a multi-disciplinary role and will require close collaboration with Sales Leads, BU Head and subheads, Business Operations and other business SPOCs. You will be required to help collect data, maintain data sheets up to date, undertake analysis. you will report and align with the central Business Finance team reporting to the lead of Business Finance to ensure that central-level processes, governance and metrics are adhered to.\n\n\nCreate, update, and maintain financial master data records (vendors, customers ,cost centers, contracts etc.) in ERP system\nVerify data for accuracy and completeness before entry.\nRetrieve data from relevant documents and files as needed.\nReview data for deficiencies or errors and correct any incompatibilities.\nMaintain up-to-date data on Invoicing and Collections\nCoordinate with other departments to ensure accurate data flow and timely updates.\n\n\nWhy Sattva?\n\nIt's not about us really- Because IMPACT is everybody’s business.\n\n\nCreate Impact: Make an impact with the work you do and the solutions you design\nWork Environment: Thrive in a diverse, inclusive, and collaborative environment\nLearn & Grow: Challenge yourself to learn, grow, and deliver the best you can\nFuture Ready: Work on critical issues of today that will affect our collective tomorrow\n\n\nHow to Prepare?\n\nThis is your opportunity to showcase not only your qualifications but also your unique personality and passion for making a meaningful impact. Approach your application with intentionality, ensuring that each word reflects your commitment to excellence and aligns seamlessly with the values of Sattva.\n\nFAQs on the Hiring Process\n\nNext Steps\n\nSattva is an equal opportunity employer and considers qualified applicants regardless of race, religion, caste, creed, gender, sexual orientation, physical or mental disability, or any other legally protected and/or marginalized characteristics. Diversity, Equity, and Inclusion are essential to our business and we foster an environment of respect and a culture that celebrates diversity and promotes equity and inclusion. We are committed to providing all employees with education, training, and development opportunities to create a workplace where everyone feels safe, respected, and included.\nShow more "
  }
]